<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('users')->insert([
            'phone' => '09192952755',
            'name' => 'admin',
            'password'=>bcrypt(123456),
            'chat_id'=> '57647493'
        ]);

        DB::table('stages')->insert([
            'title' => 'مرحله اول',
            'passage' => 'بخش اول: حمد و ثنای الهی￼
            ا َ ْل َح ْم د  ّ َ ّ    ا ل َ ذ ی َع   ف ی ت َ َو  ح ّد ّه  َو  د َ ن ا ف ی ت َ ف َ  ر ّد ّه  َو َج َل  ف ی س ْل ط ا ّن ّه  َو َع ظ َم  ف ی ا َ ْر ک ا ّن ّه ، َو ا َ ح ا َط  ّب ک ّل  َش ی ء  ّع ْل م  ا َو  ه َو  ف ی َم ک ا ّن ّه  َو  قَ َه َر  َجمی َع  ا ْل َخ ْل ّق  ّبقدْ َر ّت ّه  َو  ب ْرها ّن ّه، َحمید ا لَ ْم  َی َز ْل، َم ْحمود ا   َیزال  ( َو  َمجید ا   َیزول، َوم ْب ّدئ ا َومعید ا َو  ک  ل  أَ ْمر  ّإلَ ْی ّه  َیعود ). با ّرئ  ا ْل َم ْسموکا ّت  َودا ّحی ا ْل َمدْحوا ّت  َو َجبار  ا ْ َ َرضی َن  َو  السماوا ّت، قد وس  س  بوح، َر  ب  ا ْل َم ئ َک ّة  َوال  روحّ، متَفَ ّضل  َع لی َجمی ّع  َم ْن  َب َرأَه، متَ َط ّول  َعلی َجمی ّع  َم ْن  أَ ْن َشأَه . َی ْل َحظ  ک َل  َع ْین  َوا ْلعیون   تَراه .
            ستایش خدای را سزاست که در یگانگی اش بلند مرتبه و در تنهایی اش به آفریدگان نزدیک است؛ سلطنتش پرج ل و
            در ارکان آفرینش اش بزرگ است. بی آنکه مکان گیرد و جابه جا شود، بر همه چیز احاطه دارد و بر تمامی آفریدگان￼ به قدرت و برهان خود چیره است.
            همواره ستوده بوده و خواهد بود و مجد و بزرگی او را پایانی نیست. آغاز و انجام از او و برگشت تمامی امور به سوی اوست.
            اوست آفریننده آسمان ها و گستراننده زمین ها و حکمران آن ها. دور و منزه از خصایص آفریده هاست و در منزه بودن خود نیز از تقدیس همگان برتر است. هموست پروردگار فرشتگان و روح؛ افزونی بخش آفریده ها و نعمت ده ایجاد شده هاست. به یک نیم نگاه دیده ها را ببیند و دیده ها هرگز او را نبینند.
            َکریم  َحلیم  ذوأَنات، قَد ْ َو ّس َع  ک َل  َشیء  َر ْح َمته  َو  َم َن  َعلَ ْی ّه ْم  ّب ّن ْع َم ّت ّه .   َی ْع َجل  ّبا ْن ّتقا ّم ّه، َو یبا ّدر  ّإلَ ْی ّه ْم  ّب َما ا ْستَ َحق وا ّم ْن  َعذاب ّه . قَدْفَهم  ال َسرا ّئر  َو  َع ّلم  ال َضما ّئر، َو َلم  تَ ْخ َف  َعلَ ْی ّه  اَ ْلم ْکنونات  و  ا ْشتَ َب َه ْت  َعلَ ْی ّه  ا ْل َخ ّفیات . لَه  ا ْ حا َطة  بکل  َشیء،
            َََََّّْ ّّّ والغَلَ َبة  علی ک ّل  َشیء  والق َوة  فی ک ّل  َشئ  والقدْ َرة  َعلی ک ّل  َشئ  َولَ ْی َس  ّمثْلَه  َشیء . َو  ه َو  م ْن ّشئ  ال َشی ّء  حی َن    َشی َء  دائم  َحی َوقائم  ّبا ْل ّق ْس ّط،   ّإ  َه  ّإ َ ه َو  ا ْل َعزیزا ْل َحکیم .
            َجَل  َعْن أَْن تدّْرَکه اْ َْبصار  َو هَو یدّْرک اْ َْبصاَر  َو هَواللَطیف اْلَخبیر . َیْلَحق أََحد  َو ْصفَه  ّمْن معاَینَة، َو َیّجد أََحد  َکْی َف ￼ هَوّمْن  ّسر َو  َع ّنَیة ّإ ّبمادََل  َعَزَوَجَل  َعلینَْفّسّه .
            کریم و بردبار و شکیباست. رحمت اش جهان شمول و عطایش منّت گذار. در انتقام بی شتاب و در کیفر سزاواران عذاب، صبور و شکیباست. بر نهان ها آگاه و بر درون ها دانا. پوشیده ها بر او آشکار و پنهان ها بر او روشن است. او راست فراگیری و چیرگی بر هر هستی. نیروی آفریدگان از او و توانایی بر هر پدیده ویژه اوست. او را همانندی نیست
            و هموست ایجادگر هر موجود در تاریکستان  شیء. جاودانه و زنده و عدل گستر. جز او خداوندی نباشد و اوست ارجمند و حکیم.
            دیده ها را بر او راهی نیست و اوست دریابنده دیده ها. بر پنهانی ها آگاه و بر کارها داناست. کسی از دیدن به وصف او
            نرسد و بر چگونگی او از نهان و آشکار دست نیابد مگر، او - ع ّزوج ّل  - خود، راه نماید و بشناساند.￼
            َوأَ ْش َهد  أَنَه    أ َلذی َم َل َ الدَ ْه َر  قدْسه، َوالَذی َی ْغ َشی ا ْ َ َبد َ نوره، َوالَذی ی ْن ّفذ  أَ ْم َره  ّب مشا َو َر ّة  مشیر  َو  َم َعه  َشریک  فی تَ ْقدی ّر ّه  َو یعا َون  فی تَدْبی ّر ّه . َص َو َر  َما ا ْبتَدَ َع  َعلی َغ ْی ّر  ّمثال، َو  َخلَ َق  ما َخلَ َق  ّب  َمعونَة  ّم ْن  أَ َحد  َو  تَ َکل ف  َو َ ا ْح ّتیال . أَ ْن َشأَها فَکانَ ْت  َو  َب َرأَها فَبانَ ْت .
            فَه َو  الَذی   ّإ  َه  ّإ َ هوالمتْ ّقن  ال َص ْن َع َة، اَ ْل َح َسن  ال َصنی َع ّة، ا ْل َعدْل  الَذی   َیجور، َوا ْ َ ْک َرم  الَذی تَ ْر ّجع  ّإلَ ْی ّه  ا ْ مور .￼
            َوأَ ْش َهد  أَنَه    ا َلذی تَوا َض َع  ک  ل  َشیء  ّل َع َظ َم ّت ّه، َوذَ َل  ک  ل  َشیء  ّل ّع َز ّت ّه، َوا ْستَ ْسلَ َم  ک  ل  َشیء  ّلقدْ َر ّت ّه، َو َخ َض َع  ک  ل  َشیء  ّل َه ْی َب ّت ّه .￼ َم ّلک  ا ْ َ ْم  ّک  َو  مفَ ّلک  ا ْ َ ْف  ّک  َوم َس ّخرال َش ْم ّس  َوا ْلقَ َم ّر، کل  َی ْجری ّ  َ َجل  م َسمی. ی َک ّورالَل ْی َل  َعلَی النَها ّر  َوی َک ّورالنَها َر  َعلَی الَل ْی ّل  َی ْطلبه  َحثیث ا. قا ّصم  ک ّل  َجبار  َعنید  َو  م ْه ّلک  ک ّل  َش ْیطان  َمرید .
            و گواهی می دهم که او « » است. همو که تن ّزهش سراسر روزگاران را فراگیر و نورش ابدیت را شامل است. بی مشاور، فرمانش را اجرا، بی شریک تقدیرش را امضا و بی یاور سامان دهی فرماید. صورت آفرینش او را الگویی نبوده و آفریدگان را بدون یاور و رنج و چاره جویی، هستی بخشیده است. جهان با ایجاد او موجود و با آفرینش او پدیدار شده است.
            پس اوست « » که معبودی به جز او نیست. همو که ُصنعش استوار است و ساختمان آفرینشش زیبا. دادگری است که￼ ستم روا نمی دارد و کریمی که کارهابه او بازمی گردد.
            و گواهی می دهم که او « » است که آفریدگان در برابر بزرگی اش فروتن و در مقابل ع ّزتش رام و به توانایی اش تسلیم و به هیبت و بزرگی اش فروتن اند. پادشاه هستی ها و چرخاننده سپهرها و رام کننده آفتاب و ماه که هریک تا اَ َجل معین جریان یابند. او پردی شب را به روز و پردی روز را - که شتابان در پی شب است - به شب پیچد. اوست شکنندی
            هر ستمگر سرکش و نابودکنندی هر شیطان رانده شده.
            لَْم َیکْن لَه ّضد َو َمَعه ّند أََحد  َصَمد َلْم َیّلد َْولَْم یولَد َْولَْم َیکْن لَه کْفو اأََحد .إ ه واّحد َوَرب ماّجد َیشاء فَیْمضی،َویرید  فَ َی ْقضی، َو َی ْعلَم  فَی ْحصی، َویمیت  َوی ْحیی، َوی ْف ّقر  َوی ْغنی، َوی ْض ّحک  َوی ْبکی، ( َویدْنی َو  ی ْقصی) َو َی ْمنَع  َو  ی ْعطی، لَه  ا ْلم ْلک  َولَه اْل َحْمد، ّبَیّدّه اْل َخْیر  َو هَو  َعلیک ّل  َشیء قَدیر .
            یو ّلج  الَل ْی َل  ّفی النَها ّر  َویو ّلج  النَها َر  فی الَل ْی ّل،   ّإ  َه  ّإ ه َوا ْل َعزیز  ا ْلغَفار . م ْستَجیب  الد عا ّء  َوم ْج ّزل  ا ْل َعطا ّء، م ْح ّصی ا ْ َ ْنفا ّس  َو  َر  ب  ا ْل ّجنَ ّة  َوالنا ّس، ا َلذی  ی ْش ّکل  َعلَ ْی ّه  َشیء، َو   یض ّجره  صراخ  ا ْلم ْستَ ْص ّرخی َن  َو ی ْب ّرمه  ّإ ْلحاح  ا ْلم ّلحی َن .
            ا َ ْل ع ا ّص م  ّل ل ص ا ّل ح ی َن ، َو ا ْل م َو ّف ق  ّل ْل م ْف ّل ح ی َن ، َو  َم ْو ل َ ی ا ْل م ْؤ ّم ن ی َن  َو َر  ب  ا ْل ع ا َل م ی َن  . ا ل َ ّذ ی ا ْس ت َ َح َق  ّم ْن  ک ّل  َم ْن  َخ َل َق  أ َ ْن  َ ی ْش ک َر ه ￼ َو َی ْح َمدَه  ( َعلی ک ّل  حال )
            نه او را ناسازی باشد و نه برایش انباز و مانندی. یکتا و بی نیاز، نه زاده و نه زاییده شده، او را همتایی نبوده، خداوند یگانه و پروردگار بزرگوار است. بخواهد و به انجام رساند. اراده کند و حکم نماید. بداند و بشمارد. بمیراند و زنده کند. نیازمند و بی نیاز گرداند. بخنداند و بگریاند. نزدیک آورد و دور برد. بازدارد و عطا کند. او راست پادشاهی و ستایش.
            به دست توانی اوست تمام نیکی. و هموست بر هر چیز توانا.
            شب را در روز و روز را در شب فرو برد. معبودی جز او نیست؛ گران مایه و آمرزنده؛ اجابت کنندی دعا و افزایندی عطا، بر شمارندی نفَس ها؛ پروردگار پری و انسان. چیزی بر او مشکل ننماید، فریاد فریادکنندگان او را آزرده نکند و
            اصرار  اصرارکنندگان او را به ستوه نیاورد.￼ نیکوکاران را نگاهدار، رستگاران را یار، مؤمنان را صاحب اختیار و جهانیان را پروردگار است؛ آن که در همه
            احوال سزاوار سپاس و ستایش آفریدگان است. أَ ْح َمده  َکثیر ا َوأَ ْشکره  دائم ا َعلَی ال َسرا ّء  وال َضرا ّء  َوال ّشدَ ّة  َوال َرخا ّء، َوأو ّمن  ّب ّه  و ّب َم ئ َک ّت ّه  وکت ّب ّه  َورس ّل ّه . أَ ْس َمع  ّ  َ ْم ّر ّه 
            َواطیع  َوأبا ّدر  ّإلی ک ّل  ما َی ْرضاه  َوأَ ْستَ ْس ّلم  ّلماقَضاه، َر ْغ َبة  فی طا َع ّت ّه  َو  َخ ْوف ا ّم ْن  عقو َب ّت ّه، ّ  َنَه    الَذی  ی ْؤ َمن  َم ْکره ￼ َو یخاف  َجوره .
            او را ستایش فراوان و سپاس جاودانه می گویم بر شادی و رنج و بر آسایش و سختی و به او و فرشتگان و نبشته ها و￼ فرستاده هایش ایمان داشته، فرمان او را گردن می گذارم و اطاعت می کنم؛ و به سوی خشنودی او می شتابم و به حکم او تسلیمم؛ چرا که به فرمانبری او شائق و از کیفر او ترسانم. زیرا او خدایی است که کسی از مکرش در امان نبوده و از بی عدالتیش ترسان نباشد (زیرا او را ستمی نیست).
            بخش دوم: فرمان الهی برای مطلبی مهم
            َوأّق رلَه  َعلینَْفسیّباْلعبوّدَیّة َو أَْشَهد لَه ّبال ربوّبَیّة،َوأَؤدیماأَْوحیّبّه ّإلَی َحذَر اّمْن أَْن  أَْفَعَل فَتَّحَل بیّمْنه قاّرَعة ￼   َیدْفَعها َعنی أَ َحد  َو ّإ ْن  َعظ َم ْت  حیلَته  َو َصفَ ْت  خلَته 
            -   ّإ  َه  ّإ َه َو  - ّ  َنَه  قَدْأَ ْعلَ َمنی أَ ّنی ّإ ْن  لَ ْم  أ َب ّل ْغ  ما أَ ْن َز َل  ّإلَی (فی َح ّق  َع ّلی) فَما َبلَ ْغت  ّرسالَتَه، َوقَد ْ َض ّم َن  لی تَبا َر َک  َوتَعالَی اْلّع ْصَمة َ(ّم َن النا ّس ) َو هَو اْلکاّفیاْل َکریم .
            و اکنون به عبودیت خویش و پروردگاری او گواهی می دهم. و وظیفه خود را در آن چه وحی شده انجام می دهم مباد که از سوی او عذابی فرود آید که کسی یاری دورساختن آن از من نباشد. هر چند توانش بسیار و دوستی اش (با من) خالص باشد.
            - معبودی جز او نیست - چرا که اع م فرموده که اگر آن چه (درباره ی علی) نازل کرده به مردم نرسانم، وظیفه رسالتش را انجام نداده ام؛ و خداوند تبارک و تعالی امنیت از [آزار] مردم را برایم تضمین کرده و البته که او بسنده و بخشنده است.
            فَأَْوحیّإلَی:(ّبْسّم  الَرْحماّن الَرحیّم،یاأَیَهاالَرسول َبّلْغ ماأْنّزَل ّإَلْی َک ّمْن َرّب َک -فی َعّلیَیْعنیفّیاْلّخ َفَّة ّلَعّلیْبّن ￼ أَبی طا ّلب  - َو ّإ ْن  لَ ْم  تَ ْف َع ْل  فَما َبلَ ْغ َت  ّرسالَتَه  َو  َی ْع ّصم َک  ّم َن  النا ّس ).
            َمعاّشَرالناّس،ماقَ َصْرت فیتَْبلیّغ ماأَْنَزَل  تَعالیّإلَی،َو أَنَاأَبّین َلکْم  َسَبَب هّذّه اْ َیّة :ّإَن  َجْبرئیَل  َهَبَط ّإلَیّمرار اثَ ث ا
            َ ی أ ْ م ر ن ی َ ع ّ ن   ا ل َ س   ّ م   َ ر ب ی - َ و   ه و ا ل َ س   م   - أ َ ْ ن   أ َ ق و َ م   ف ی ه ذ َ ا ا ْ ل َ م ْ ش َ ه ّ د   ف َ أ ْ ع ّ ل َ م   ک َ ل   أ َ ْ ب َ ی َض   َ و أ َ ْ س َ و د   َ : أ َ َ ن   َ ع ّ ل ی ْ ب َ ن   أ َ ب ی ط ا ّ ل ب   أ َ خ ی َ و  
            َوصیی َو  َخلیفَتی ( َعلی أمتی) َوا ْ مام  ّم ْن  َب ْعدی، الَذی م َحل ه  ّمنی م َح  ل  هارو َن  ّم ْن  موسی إ َ أَنَه   نَبی َب ْعدی َوه َو  َو ّل  یکم  َََّّّّْ
            َب ْعدَ  َو  َرسو ّل ّه .
            َوقَد ْ أَ ْن َز َل    تَبا َر َک  َو  تَعالی َعلَی ّبذا ّل َک  آ َیة  ّم ْن  ّکتا ّب ّه  ( ّهی): ( ّإنَما َو ّل  یکم    َو  َرسوله  َوالَذی َن  آ َمنواالَذی َن  یقیمو َن  ال َص ة َ َوی ْؤتو َن  ال َزکاة َ َو  ه ْم  را ّکعو َن )، َو  َع ّلی ْبن  أَبی طا ّلب  الَذی أَقا َم  ال َص ة َ َو  آتَی ال َزکاة َ َوه َو  را ّکع  یرید  َع َز َو َج َل  فی ک ّل 
            حال .￼
            پس آنگاه خداوند چنین وحی ام فرستاد: «به نام خداوند همه مهر  مهرورز. ای فرستادی ما! آن چه از سوی پروردگارت درباری علی و خ فت او بر تو فرود آمده بر مردم اب غ کن، وگرنه رسالت خداوندی را به انجام نرسانده ای؛ و او تو را از آسیب مردمان نگاه می دارد.»
            هان مردمان! آنچه بر من فرود آمده، در تبلیغ آن کوتاهی نکرده ام و حال برایتان سبب نزول آیه را بیان می کنم: همانا￼ جبرئیل سه مرتبه بر من فرود آمد از سوی س م، پروردگارم - که تنها او س م است - فرمانی آورد که در این مکان به
            پا خیزم و به هر سفید و سیاهی اع م کنم که علی بن ابی طالب برادر، وصی و جانشین من در میان ا ّمت و امام پس از￼ من بوده. جایگاه او نسبت به من به سان هارون نسبت به موسی است، لیکن پیامبری پس از من نخواهد بود او (علی)، صاحب اختیارتان پس از خدا و رسول است؛
            و پروردگارم آیه ای بر من نازل فرموده که: «همانا ولی، صاحب اختیار و سرپرست شما، خدا و پیامبر او و ایمانیانی هستند که نماز به پا می دارند و در حال رکوع زکات می پردازند.» و هر آینه علی بن ابی طالب نماز به پا داشته و در رکوع زکات پرداخته و پیوسته خداخواه است.
            َ و َ س أ َ ْ ل ت   َ ج ْ ب َ ر ئ ی َ ل   أ َ ْ ن   َ ی ْ س ت َ ْ ع ّ ف ی ّ ل ی ( ا ل َ س   َ م   ) َ ع ْ ن   ت َ ْ ب ل ی ّ غ   ذ ا ّ ل َک   ّ إ ل ْ ی ک ْ م   - أ َ   ی َ ه ا ا ل ن ا س   - ّ ل ّ ع ْ ل م ی ّ ب ّ ق ل َ ّ ة   ا ْ ل م ت َ ق ی َ ن   َ و َ ک ث ْ َ ر ّ ة   ا ْ ل م ن ا ّ ف ق ی َ ن   َ و ّ إ د غ ا ّ ل  
            ال ئمی َن  َو  ّح َیل  ا ْلم ْستَ ْهزئی َن  با ْ  ْس م، ا َلذی َن  َو َصفَهم    فی ّکتاب ّه  بأَنَهم  َیقولو َن  بأَ ْل ّسنَ ّتهم  مالَ ْیس  فی قلوبهم، َو َی ْح َسبونَه ￼ ّّّّّ َّّّّّّْْْ
            َهّین ا َو هَو  ّعْندَ  َعظیم .
            َوَکثَْرّة أَذاهْم لی َغْیَر  َمَرة  َحتی َسَمونیأذن ا َو  َز َعمواأَّنی َکذاّل َک  ّل َکثَْرّة م َزَمّتّه  ّإیی َو  ّإْقبالی َعلَْیّه (َو  َهواه  َو قَبوّلّه  ّمّنی) َ ح ت ی أ َ ْ ن َ ز َ ل     َ ع َ ز َ و َ ج َ ل   ف ی ذ ا ّ ل َک   ( َ و   ّ م ْ ن ه م   ا ل َ ذ ی َ ن   ی ْ ؤ ذ و َ ن   ا ل ن َ ّ ب ی َ و   َ ی ق و ل و َ ن   ه َ و   أ ذ ن ، ق ْ ل   أ ذ ن   - ( َ ع ل َ ی ا ل َ ذ ی َ ن   َ ی ْ ز ع م و َ ن   أ َ ن َ ه   أ ذ ن   ) - َخ ْیر  لَک ْم، ی ْؤ ّمن  ّبا  َو  ی ْؤ ّمن  ّل ْلم ْؤ ّمنی َن ) ا  َیة .
            و من از جبرئیل درخواستم که از خداوند س م اجازه کند و مرا از این مأموریت معاف فرماید. زیرا کمی پرهیزگاران و فزونی منافقان و دسیسی م مت گران و مکر مسخره کنندگان اس م را می دانم؛ همانان که خداوند در کتاب خود در وصفشان فرموده: «به زبان آن را می گویند که در دل هایشان نیست و آن را اندک و آسان می شمارند حال آن که نزد خداوند بس بزرگ است.»
            و نیز از آن روی که منافقان بارها مرا آزار رسانیده تا بدانجا که مرا اُذُن [سخن شنو و زودباور ]نامیده اند، به خاطر همراهی افزون علی با من و رویکرد من به او و تمایل و پذیرش او از من، تا بدانجا که خداوند در این موضوع آیه ای فرو فرستاده: « و از آنانند کسانی که پیامبر خدا را می آزارند و می گویند: او سخن شنو و زودباور است. بگو: آری
            سخن شنو است. - بر علیه آنان که گمان می کنند او تنها سخن می شنود - لیکن به خیر شماست، او (پیامبر صلی  ￼ علیه و آله) به خدا ایمان دارد و مؤمنان را تصدیق می کند و راستگو می انگارد.»
            َولَ ْو ّشئْت  أَ ْن  أ َس ّمی ا ْلقائلی َن  ّبذا ّل َک  ّبأَ ْسمائ ّه ْم  َل َس َم ْیت  َوأَ ْن  أ ْو ّم َئ  ّإلَ ْی ّه ْم  ّبأَ ْعیا ّن ّه ْم  َ َ ْو َمأْت  َوأَ ْن  أَد َل  َعلَ ْی ّهم  لَدَلَ ْلت، َول ّک ّنی َو  ف ی أ م و ّر ه ْم  ق َ د  ْ ت َ َک َر ْم ت  . َو ک  ل  ذ ا ّل َک    َی ْر َض ی   ّم ن ی ّإ     أ َ ْن  أ َب ّل َغ  م ا أ َ ْن َز َل    ّإ ل َ ی ( ف ی َح ّق  َع ّل ی ) ، ث َم  ت   : ( ی ا أ َ  ی َه ا ا ل َر س و ل  َ ب ّ ل ْ غ   م ا أ ْ ن ّ ز َ ل   ّ إ ل َ ْ ی َک   ّ م ْ ن   َ ر ّ ب َک   - ف ی َ ح ّ ق   َ ع ّ ل ی - َ و   ا ْ ن   ل َ ْ م   ت َ ْ ف َ ع ْ ل   ف َ م ا َ ب ل َ ْ غ َ ت   ّ ر س ا ل َ ت َ ه   َ و   َ ی ْ ع ّ ص م َک   ّ م َ ن   ا ل ن ا ّ س   ) .
            و اگر می خواستم نام گویندگان چنین سخنی را بر زبان آورم و یا به آنان اشارت کنم و یا مردمان را به سویشان هدایت کنم [که آنان را شناسایی کنند] می توانستم. لیکن سوگند به خدا در کارشان کرامت نموده لب فروبستم. با این حال خداوند از من خشنود نخواهد گشت مگر این که آن چه در حق علی عیه ال ّس م فرو فرستاده به گوش شما برسانم. سپس
            پیامبر صلّی   علیه و آله چنین خواند: «ی پیامبر ما! آن چه از سوی پروردگارت بر تو نازل شده - در ح ّق  علی -￼ اب غ کن؛ وگرنه کار رسالتش را انجام نداده ای. و البته خداوند تو را از آسیب مردمان نگاه می دارد.»'

        ]);

        DB::table('questions')->insert([
            'title' => ' موضوع فرازهای اول خطبه غدیر چیست اولین ایه ای که حضرت رسول صلی الله علیه و اله در خطبه قرائت می فرمایند کدام ایه می باشد؟',
            'option_a' => ' انما ولیکم الله و رسوله الذین یقیمون الصلوه و یوتون الزکوه و هم راکعون',
            'option_b' => 'یقولون بالسنتهم ما لیس فی قلوبهم و یحسبونه هینا و هو عندالله عظیم',
            'option_c' => ' یا ایها الرسول بلغ  ماانزل الیک من ربک و ان لم تفعل فما بلغت رسالته والله یعصمک من الناس',
            'correct'=>'b',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'موضوع فرازهای ابتدایی خطبه غدیر چیست؟',
            'option_a' => ' حمد و ثنای الهی_اعلان رسمی ولایت',
            'option_b' => 'حمد و ثنای الهی_اعلان رسمی ولایت',
            'option_c' => ' احمد و ثنای الهی_تاکید بر توجه امت به مساله امامت',
            'correct'=>'b',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'در فرازهای آغازین خطبه بیان شده پیامبر در چه صورت وظیفه رسالتش را انجام نداده است؟',
            'option_a' => 'اگر آنچه درباره علی علیه السلام نازل شده به مردم نرساند.',
            'option_b' => 'اگر فرمان الهی را به مردم نرساند. ',
            'option_c' => ' اگر آیات نازل شده را به مردم نرساند.',
            'correct'=>'a',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'جبرئیل چندبار برای رساندن امر الهی بر حضرت رسول صلی الله علیه و اله و سلم درامر ولایت امیرالمؤمنین نازل شد؟',
            'option_a' => '3',
            'option_b' => '2 ',
            'option_c' => ' 1',
            'correct'=>'a',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'چرا منافقین پیامبر صلی الله علیه و اله و سلم را "اذن" خوانده اند؟',
            'option_a' => ' به سبب کم صحبت بودن و زیاد شنونده بودن ایشان',
            'option_b' => 'به سبب کثرت ملازمت امیرالمومنین علیه السلام با ایشان و گرایش پیامبر صلی الله علیه و اله به ان حضرت',
            'option_c' => 'فقط برای اینکه به حضرت رسول صلی الله علیه و اله توهین نمایند',
            'correct'=>'b',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'چرا پیامبر صلی الله علیه و اله از اعلام نام منافقین خودداری نمودند؟',
            'option_a' => 'بخاطر کرامت کردن حضرت درکار ایشان',
            'option_b' => 'بخاطر حفظ وحدت',
            'option_c' => 'بخاطر جلوگیری از بروز فتنه',
            'correct'=>'a',
            'stage_id'=> 1
        ]);

        ######################## stage 2

        DB::table('stages')->insert([
            'title' => 'مرحله دوم',
            'passage' => 'بخش سوم: اع ن رسمی و یت و امامت دوازده امام علیهم الس م￼
            فَاْعلَُمواَمعاِشَرالنّاِس(ذاِل َکفیِهَواْفَهموهَُواْعلَُموا)أَ ن قَدْنَ َصَبهُلَُکْمَوِلیّاًَوِإماماًفََر َضطاَعتَهُ َعلَیاْلُمهاِجریَن َواْ َْنصاِرَو َعلَیالتّاِبعیَنلَُهْمِبِإْحساٍن،َو َعلَیاْلبادیَواْلحاِضِر،َو َعلَیاْلَعَجِمیَواْلَعَربی،َواْلُحِّرَواْلَمْملوِک
            َوال  صغیِر َواْل َکبیِر، َو َعلَیاْ َْبَی ِض َوا َ ْسَوِد، َو َعلی ُکِّل ُمَوِّحٍد.￼￼￼ م ا ٍض ُح ْک ُم ه ُ ، ج ا ٍز ق َ ْو ل ُ ه ُ ، ن ا ِف ذ ٌ أ َ ْم ُر ُه ، َم ْل ع و ٌن َم ْن خ ا ل َ ف َ ه ُ ، َم ْر ح و ٌم َم ْن ت َ ِب َع ه ُ َو َص د   ق َ ه ُ ، ف َ ق َ د ْ َغ ف َ َر   ل َ ه ُ َو ِل َم ْن َس ِم َع ِم ن ْ ه ُ َو
            أ َ ط ا َع ل َ ه ُ .￼￼
            معا ِشرالنّا ِس، إن هُ آ ِخ ُر مقا ٍم أَقُو ُمهُ فی هذا ا ْلم ْش َه ِد، فَا ْسمعوا َو أَطیعوا َوا ْنقادوا ِ  َ ْمر( ) ربّ ُک ْم، فَإ  ن   َع  ز َو َج  ل ََََََِِِِ
            ُهَومْو ُکْمَوإ ُهُکْم،ثُ مِمْندوِنِهرسولُهَُونَبیُهُاْلَُمخاِطُبلَُکْم،ثُ مِمْنَبْعدی َعلیَوِلی ُکْمَوإماُمُکْمبأَْمر ربُّکْم، ََِِ َِِِِ
            ثُ ماْ مامةُفیذُّری تی ِم ْن ُوْلِدِهإلی َیْوٍمتَْلقَْو َن  َورسولَهُ. ََِِِ
            هان مردمان! بدانید این آیه درباری اوست. ژرفی آن را فهم کنید و بدانید که خداوند او را برایتان صاحب اختیار و امام قرار داده، پیروی او را بر مهاجران و انصار و آنان که به نیکی از ایشان پیروی می کنند و بر صحرانشینان و شهروندان و بر عجم و عرب و آزاد و برده و بر کوچک و بزرگ و سفید و سیاه و بر هر یکتاپرست  زم شمرده است.
            [هشدار که] اجرای فرمان و گفتار او  زم و امرش نافذ است. ناسازگارش رانده، پیرو و باورکننده اش در مهر و شفقت است. هر آینه خداوند، او و شنوایان سخن او و پیروان راهش را آمرزیده است.
            هان مردمان! آخرین بار است که در این اجتماع به پا ایستاده ام. پس بشنوید و فرمان حق را گردن گذارید؛ چرا که
            خداوند ع ّزوج ّل صاحب اختیار و ولی و معبود شماست؛ و پس از خداوند ولی شما، فرستاده و پیامبر اوست که￼ اکنون در برابر شماست و با شما سخن می گوید. و پس از من به فرمان پروردگار، علی ولی و صاحب اختیار و امام شماست. آن گاه امامت در فرزندان من از نسل علی خواهد بود. این قانون تا برپایی رستاخیز که خدا و رسول او را دیدار کنید دوام دارد.
              َح   َل ِإ   ّ م ا أ َ َح ل   ه ُ   َو َر ُس و ل ُ ه ُ َو ُه ْم ، َو   َح ر ا َم ِإ   ّ م ا َح  ر َم ه ُ   ( َع ل َ ْی ُک ْم ) َو َر ُس و ل ُ ه ُ َو ُه ْم ، َو   َع  ز َو َج  ل َع  ر ف َ ن ِ ی ا ْل َح   َل
            َواْلَحرامَوأَنَاأَْف َضْیُتبما َعل منیربّیِمْنِکتابِهَوَح ِلِهَو َحراِمِهإلَْیِه. َََِِِِ
            َمعاِشَرالنّاِس،علی(فَِّضلُوهُ).ماِمْن ِعْلٍمِإ  َوقَدْأَْحصاهُ ِفی،َوُک ل ِعْلٍم ُعِلّْمُتفَقَدْأَْح َصْیتُهُفیِإماِماْلُمت قیَن،َوما
            ِمْن ِعْلٍمإ ّ َوقَدْ َعل ْمتُهُ َعِلیّاً، َو ُهَواْ ماُماْلُمبیُن(ا لذیذََکرهُ فی ُسورِةیس:(َو ُک ل َشیٍءأَْح َصْیناهُفیإماٍم ََِِِ
            ُمبی ٍن).￼
            معا ِشرالن ا ِس،  تَضل وا َع ْنهُ َو تَ ْن ِف ُروا ِم ْنهُ، َو تَ ْستَ ْن ِکفُوا َع ْن و  َی ِت ِه، فَ ُه َوال ذی َیهدی إلَی ا ْل َح ّق َو َی ْعم ُل ب ِه، َویُ ْز ِه ُق َََِِِِِ
            اْلباِطَلَوَیْنهی َعْنهُ،َو تَأُْخذُهُِفی لَْوَمةُ ِئٍم.أَ وُلَمْنآَمَنِبا َوَرُسوِلِه(لَْمَیْسِبْقهُِإلَیاْ یماِنبیأََحدٌ)،َوا لذی فَدی َر ُسو َل  ِبنَ ْف ِس ِه، َوال ذیکا َن َم َع َر ُسو ِل  َو أَ َحدَ َی ْعبُدُ  َم َع َر ُسوِل ِه ِم َنالِّرجا ِل َغْی ُرهُ.
            (أَ وُلالنّاِس َص ةًَوأَ وُلَمْن َعَبدَ َمعی.أََمْرتُهُ َعِن أَْنَیناَمفیَم ْضَجعی،فَفََعَلفاِدیاًلیِبنَْفِسِه).
            روا نیست، مگر آن چه خدا و رسول او و امامان روا دانند؛ و ناروا نیست مگر آن چه آنان ناروا دانند. خداوند￼ عزوجل، هم روا و هم ناروا را برای من بیان فرموده و آن چه پروردگارم از کتاب خویش و ح ل و حرامش به من آموخته در اختیار علی نهاده ام.
            هان مردمان! او را برتر بدانید. چرا که هیچ دانشی نیست مگر اینکه خداوند آن را در جان من نبشته و من نیز آن را در جان پیشوای پرهیزکاران، علی، ضبط کرده ام. او (علی) پیشوای روشنگر است که خداوند او را در سوری یاسین یاد کرده که: «و دانش هر چیز را در امام روشنگر برشمرده ایم...»
            هان مردمان! از علی رو برنتابید. و از امامتش نگریزید. و از سرپرستی اش رو برنگردانید. او [شما را] به
            درستی و راستی خوانده و [خود نیز] بدان عمل نماید. او نادرستی را نابود کند و از آن بازدارد. در راه خدا￼ نکوهش نکوهش گران او را از کار باز ندارد. او نخستین مؤمن به خدا و رسول اوست و کسی در ایمان، به او سبقت نجسته. و همو جان خود را فدای رسول   نموده و با او همراه بوده است تنها اوست که همراه رسول خدا عبادت خداوند می کرد و جز او کسی چنین نبود.
            اولین نمازگزار و پرستشگر خدا به همراه من است. از سوی خداوند به او فرمان دادم تا [در شب هجرت] در بستر من بیارامد و او نیز فرمان برده، پذیرفت که جان خود را فدای من کند.
            معا ِشرالنّا ِس، فَ ّضلُوهُ فَقَدْ فَ  ضلَهُ  ، َوا ْق َبلُوهُ فَقَدْ نَ َص َبهُ  . ََِ
            َ م ع ا ِ ش َ ر ا ل ن ّ ا ِ س ، ِ إ ن   ه ُ ِ إ م ا ٌ م ِ م َ ن   ، َ و ل َ ْ ن َ ی ت ُ و َ ب   َ ع ل ی أ َ َ ح ٍ د أ َ ْ ن َ ک َ ر ِ و   َ ی ت َ ه ُ َ و ل َ ْ ن َ ی ْ غ ِ ف َ ر ل َ ه ُ ، َ ح ت ْ م ا ً َ ع ل َ ی   أ َ ْ ن َ ی ْ ف َ ع َ ل ذ ا ِ ل َک ِ ب َ م ْ ن خالَ َف أَ ْم َرهُ َوأَ ْن یُ َع ِذّ َبهُ َعذاباً نُ ْکراً أَ َبدَا ا ْ با ِد َو دَ ْه َر الد هو ِر. فَا ْحذَ ُروا أَ ْن تُخا ِلفوهُ. فَتَ ْصلُوا ناراً َوقودُ َها الن ا ُس َوا ْل ِحجا َرةُ أُ ِعد  ْت ِل ْلکا ِفری َن.
            هان مردمان! او رابرتر دانید، که خداوند او را برگزیده؛ و پیشوایی او را بپذیرید، که خداوند او را برپا کرده است.
            هان مردمان! او از سوی خدا امام است و هرگز خداوند توبه منکر او را نپذیرد و او را نیامرزد. این است روش￼ قطعی خداوند درباره ناسازگار علی و هرآینه او را به عذاب دردناک پایدار کیفر کند. از مخالفت او بهراسید و گرنه در آتشی درخواهید شد که آتش گیری آن مردمانند؛ و سنگ، که برای حق ستیزان آماده شده است.
            م ع ا ِش ر ا ل ن ّ ا ِس ، ب ی - َو   - َب  ش ر ا ْ  َ  و ل ُ و َن ِم َن ا ل ن   ب ی ّ ی َن َو ا ْل ُم ْر َس ل ی َن ، َو أ َ ن َ ا - ( َو   ) - خ ا ت َ ُم ا ْ  َ ْن ب ی ا ِء َو ا ْل ُم ْر َس ل ی َن و ا ْل ُح  ج ة ُ َََِِِ
            َ ع ل ی َ ج م ی ِ ع ا ْ ل َ َ م ْ خ ل و ق ی َ ن ِ م ْ ن أ َ ْ ه ِ ل ا ل   س م ا و ا ِ ت َ و ا ْ   َ َ ر ض ی َ ن . ف َ َ م ْ ن َ ش  ک ف ی ذ ا ِ ل َک ف َ ق َ د ْ َ ک ف َ َ ر ُ ک ْ ف َ ر ا ْ ل ج ا ِ ه ِ ل ی   ِ ة ا ْ   ُ و ل ی َ و َ م ْ ن َ ش  ک ف ی َ ش ی ٍ ء ِ م ْ ن ق َ ْ و ل ی ه ذ ا ف َ ق َ د ْ َ ش  ک ف ی ُ ک ِ ّ ل م ا أ ُ ْ ن ِ ز َ ل ِ إ ل َ ی ، َ و َ م ْ ن َ ش  ک ف ی و ا ِ ح ٍ د ِ م َ ن ا ْ   َ ئ   م ِ ة ف َ ق َ د ْ َ ش  ک ِ ف ی ا ْ ل ُ ک ِ ّ ل ِ م ْ ن ُ ه ْ م ، َوال َشا  ک فینا ِفی النّا ِر.
            َمعا ِش َرالنّا ِس، َحبا ِنی   َع  ز َو َج  ل ِبه ِذ ِه ا ْلفَضیلَ ِة َمنّاً ِم ْنهُ َعلَی َو ِإ ْحساناً ِم ْنهُ ِإلَی َو  ِإ  َه ِإ ّ ُه َو، أَ  لَهُ ا ْل َح ْمدُ ِم ِنّی أَ َبدَ
            اْ ِبدیَنَودَْهَرالدّاِهریَنَو َعلیُکِّلحاٍل.￼
            هان مردمان! به خدا سوگند که پیامبران پیشین به ظهورم مژده داده اند و اکنون من فرجام پیامبران و برهان بر آفریدگان آسمانیان و زمینیانم. آن کس که راستی و درستی مرا باور نکند به کفر جاهلی درآمده و تردید در سخنان امروزم همسنگ تردید در تمامی محتوای رسالت من است، و شک و ناباوری در امامت یکی از امامان، به سان
            شک و ناباوری در تمامی آنان است. و هرآینه جایگاه ناباوران ما آتش دوزخ خواهد بود.￼
            هان مردمان! خداوند ع ّزوج ّل از روی منّت و احسان خویش این برتری را به من پیشکش کرد و البته که خدایی￼ جز او نیست. آگاه باشید: تمامی ستایش ها در همه روزگاران و در هر حال و مقام ویژی اوست.
            َمعاِشَرالنّاِس،فَِّضلُوا َعِلیّاًفَِإن هُأَْف َضُلالن اِسَبْعدیِمْنذََکٍروأُْنثیماأَْنَزَل الِّرْزَقَوَبِقیاْلَخْلُق. َمْلعُو ٌن َمْلعُو ٌن، َمْغ ُضو ٌب َمْغ ُضو ٌب َم ْن َرد  َعلَیقَْولیهذا َولَْمیُواِفْقهُ.
            أ َ   ِ إ   ن َ ج ْ ب ر ئ ی َ ل َ خ ب   ر ن ی َ ع ِ ن   ت َ ع ا ل ی ِ ب ذ ا ِ ل َک َ و َ ی ق ُ و ُ ل : « َ م ْ ن ع ا د ی َ ع ِ ل ی ّ ا ً َ و ل َ ْ م َ ی ت َ َ و ل   ه ُ ف َ َ ع ل َ ْ ی ِ ه ل َ ْ ع ن َ ت ی َ و َ غ َض ب ی » ، ( َ و ْ ل ت َ ْ ن ُ ظ ْ ر نَْف ٌسماقَد َمْتِلغٍَدَوات قُو -أَْنتُخاِلفُوهُفَتَِز لقَدٌَمَبْعدَثُبُوِتها-ِإ ن  َخبیٌرِبماتَْعَملُوَن).
            َم ع ا ِش َر ا ل ن   ا ِس ، ِإ ن   ه ُ َج ْن ُب   ا  ل ذ ی ذ َ َک َر ف ی ِک ت ا ِب ِه ا ل َع ز ی ِز ، ف َ ق ا َل ت ع ا ل ی ( ُم ْخ ِب ر ا ً َع  م ْن ی ُ خ ا ِل ف ُ ه ُ ) : ( أ َ ْن ت َ ق ُ و َل ن َ ْف ٌس ی ا َح ْس َر ت ا￼ َعلی ما فَ  ر ْط ُت فی َج ْن ِب  ).
            هان مردمان! عل را برتر دانید؛ که او برترین مردمان از مرد و زن پس از من است؛ تا آن هنگام که آفریدگان پایدارند و روزی شان فرود آید.
            دور دورباد از درگاه مهر خداوند و خشم خشم باد بر آن که این گفته را نپذیرد و با من سازگار نباشد!
            هان! بدانید جبرئیل از سوی خداوند خبرم داد: «هر آن که با علی بستیزد و بر و یت او گردن نگذارد، نفرین و خشم من بر او باد!» البته بایست که هر کس بنگرد که برای فردای رستاخیز خود چه پیش فرستاده. [هان!] تقوا پیشه کنید و از ناسازگاری با علی بپرهیزید. مباد که گام هایتان پس از استواری درلغزد. که خداوند بر کردارتان آگاه است.
            هان مردمان! همانا او هم جوار و همسایه خداوند است که در نبشته ی عزیز خود او را یاد کرده و درباری ستیزندگان با او فرموده: «تا آنکه مبادا کسی در روز رستخیز بگوید: افسوس که درباری همجوار و همسایه ی خدا
            کوتاهی کردم...»￼
            معا ِشرالنّاس، تَدَب  ُروا ا ْلقُ ْرآ َن و ا ْف َه ُموا آیا ِت ِه وا ْن ُظ ُروا إلی ُم ْح َکما ِت ِه و تَت بعوا ُمتَشاب َههُ، فَو  لَ ْن یُ َبیّ َن لَ ُک ْم زواجرهُ َََََََِِِِِِ
            َولَْنیُوِضَحلَُکْمتَْفسیَرهُِإ  ا لذیأََناآِخذٌِبَیِدِهَوُم ْصِعدُهُِإلیَوشائٌلِبَع ُضِدِه(َوراِفعُهُِبَیدَی)َوُمْعِلُمُکْم:أَ نَمْنُکْنُت َمْو هُفَهذا َعِلی َمْو هُ، َو ُهَو َعِلی ْب ُنأَبیطاِل ٍبأَخی َو َو ِصیّی، َو ُموا تُهُ ِم َن  َع زَو َج  لأَْنَزلَها َعلَی.
            هان مردمان! در قرآن اندیشه کنید و ژرفی آیات آن را دریابید و بر محکماتش نظر کنید و از متشابهاتش پیروی ننمایید. پس به خدا سوگند که باطن ها و تفسیر آن را آشکار نمی کند مگر همین که دست و بازوی او را گرفته و با  آورده ام و اع م می دارم که: هر آن که من سرپرست اویم، این علی سرپرست اوست. و او علی بن ابی طالب است؛ برادر و وصی من که سرپرستی و و یت او حکمی است از سوی خدا که بر من فرستاده شده است.
            معاِشرالنّاِس،إ نَعِلّیاًَوال طیّبیَنِمْنُوْلدی(ِمْن ُصْلبِه)ُهُمالِثّْقُلاْ َْصغَُر،َواْلقُْرآُنالِثّْقُلاْ َْکَبُر،فَُک لواِحٍدِمْنُهما￼ ََِِِ
            ُ م ْ ن ِ ب ٌ ئ َ ع ْ ن ص ا ِ ح ِ ب ِ ه َ و ُ م و ا ِ ف ٌ ق ل َ ه ُ ، ل َ ْ ن َ ی ْ ف ت َ ِ ر ق ا َ ح ت ّ ی َ ی ِ ر د ا َ ع ل َ ی ا ْ ل َ ح ْ و َض . أَ ِإن ُهْمأَُمناُء فی َخْلِقِهَو ُحّکاُمهُفیأَْرِضِه.أَ َوقَدْأَد ْیُت. أَ  َوقَدْ َبل  ْغ ُت، أَ  َوقَدْ أَ ْس َم ْع ُت، أَ  َوقَدْ أَ ْو َض ْح ُت، أَ  َو ِإ  ن   َع  ز َو َج  ل قا َل َو أَنَا قُ ْل ُت َع ِن   َع  ز َو َج  ل، أَ  ِإن هُ  
            «أَمیَراْلُمْؤِمنیَن» َغْیَرأَخیهذا،أَ  تَِح لِإْمَرةُاْلُمْؤِمنیَنَبْعدی ِ ََحٍد َغْیِرِه.￼
            هان مردمان! همانا علی و پاکان از فرزندانم از نسل او، یادگار گران سنگ کوچک ترند و قرآن یادگار گران سنگ￼ بزرگ تر. هر یک از این دو از دیگر همراه خود خبر می دهد و با آن سازگار است. آن دو هرگز از هم جدا نخواهند شد تا در حوض کوثر بر من وارد شوند.
            هان! بدانید که آنان امانتداران خداوند در میان آفریدگان و حاکمان او در زمین اویند.
            هشدار که من وظیفه ی خود را ادا کردم. هشدار که من آن چه بر عهده ام بود اب غ کردم و به گوشتان رساندم و روشن نمودم. بدانید که این سخن خدا بود و من از سوی او سخن گفتم. هشدار که هرگز به جز این برادرم کسی نباید امیرالمؤمنین خوانده شود. هشدار که پس از من امارت مؤمنان بری کسی جز او روا نباشد.
            ثم قال: «ایهاالن ا ُس، َم ْن اَ ْولی ِب ُک ْم ِم ْن اَ ْنفُ ِس ُک ْم؟ قالوا:   و َر ُسولُهُ. فَقا َل: اَ  من ُک ْن ُت َم ْو هُ فَهذا َعلی َم ْو هُ، الله  م￼ واِل َمْنوا هُوعاِد َمْنعاداهُ َواْن ُصْرَمْننَ َصَرهُواْخذُْل َمْن َخذَلَهُ.
            سپس فرمود: مردمان! کیست￼ سزاوارتر از شما به شما؟ گفتند خداوند و پیامبر او! سپس فرمود آگاه باشید! آن که من سرپرست اویم، پس این علی سرپرست اوست! خداوندا دوست بدار آن را که سرپرستی او را بپذیرد و دشمن بدار هر آن که او را دشمن دارد و یاری کن یار او را؛ و تنها گذار آن را که او را تنها بگذارد.
            َمعا ِشَرالنّا ِس،هذا َعِلیأخی َو َوصیی َوواعی ِعْلمی، َو َخلیفَتیفیاُ متی َعلی َم ْنآَم َنبی َو َعلیتَْفسیِر ِکتا ِب  َع  ز َو َج  ل َوالدّاعی ِإلَ ْی ِه َوا ْلعا ِم ُل ِبما َی ْرضاهُ َوا ْل َُمحا ِر ُب ِ  َ ْعدائ ِه َوا ْل ُموالی َعلی طا َع ِت ِه َوالنّاهی َع ْن َم ْع ِص َی ِت ِه. ِإن هُ َخ ل ی ف َ ة ُ َر ُس و ِل   َو أ َ م ی ُر ا ْل ُم ْؤ ِم ن ی َن َو ا ْ  م ا ُم ا ْل ه ا د ی ِم َن   ، َو ق ا ِت ُل ا ل ن ّ ا ِک ث ی َن َو ا ْل ق ا ِس ط ی َن َو ا ْل م ا ِر ق ی َن ِب أ َ ْم ِر   . َی ق ُ و ُل   :
            بخش چهارم: بلند کردن امیرالمومنین علیه الس م بدست رسول خداصلی￼￼￼￼￼￼￼￼￼￼   علیه و آله
            (مایُ َبد  ُل ا ْلقَ ْو ُل لَدَی).￼￼￼￼
            بأَْمرکیار ّبأَقوُل:اَل لُهموالمْنوا هُوعاِدمْنعاداهُ(واْن ُصْرمْننَ َصرهُواْخذُْلمْن َخذَلَهُ)واْلَعْنمْنأَْن َکرهُ ََِِِ َََََََََََِ
            َوا ْغ ِض ْب َعلی َم ْن َج َحدَ َحق هُ.
            هان مردمان! این علی است برادر و وصی و نگاهبان دانش من. و هموست جانشین من در میان ا ّمت و بر
            گروندگان به من و بر تفسیر کتاب خدا که مردمان را به سوی او بخواند و به آن چه موجب خشنودی اوست عمل￼￼ کند و با دشمنانش ستیز نماید. او پشتیبان فرمانبرداری خداوند و بازدارنده از نافرمانی او باشد. همانا اوست جانشین رسول   و فرمانروای ایمانیان و پیشوای هدایتگر از سوی خدا و کسی که به فرمان خدا با پیمان شکنان،
            رویگردانان از راستی و درستی و به دررفتگان از دین پیکار کند. خداوند فرماید: «فرمان من دگرگون￼ نخواهدشد.»
            پروردگارا! اکنون به فرمان تو چنین می گویم: خداوندا! دوستداران او را دوست دار. و دشمنان او را دشمن دار. پشتیبانان او را پشتیبانی کن. یارانش را یاری نما. خودداری کنندگان از یاری اش را به خود رها کن. ناباورانش را از مهرت بران و بر آنان خشم خود را فرود آور.
            الله مإن کأَْنَزْل َتاْ َیةَفی َعِلی َوِلیّک ِعْندَتَْبیینذاِلک َونَ ْصبکإیّاهُ ِلهذَااْلَیْوم:(اْلَیْومأَْکمْل ُتلَ ُکْمدینَ ُکْم َوأَتْمْم ُت َََََََِِِِِِ
            َعلَْیُکْمِنْعمتیَورضیُتلَُکُماْ ْس مدیناً)،(َومْنَیْبتَغ َغْیراْ ْس مدیناًفَلَْنیُْقَبَلِمْنهَُوُهَوفِیاْ ِخرِةِمَن َََََِِِِ َ
            ا ْل خ ا ِس ر ی َن ) . ا ل ل ه  م ِإ ِن ّ ی أ ُ ْش ِه د ُ َک أ َ ِن ّ ی ق َ د ْ َب  ل ْغ ُت .￼
            معبودا! تو خود در هنگام برپاداشتن او و بیان و یتش نازل فرمودی که: «امروز آیین شما را به کمال، و نعمت خود را بر شما به اتمام رساندم، و اس م را به عنوان دین شما پسندیدم.» «و آن که به جز اس م دینی را بجوید، از او پذیرفته نبوده، در جهان دیگر در شمار زیانکاران خواهد بود.» خداوندا، تو را گواه می گیرم که پیام تو را به مردمان رساندم.',

        ]);

        DB::table('questions')->insert([
            'title' => ' حضرت رسول صلی الله علیه و اله و سلم چه لقبی درمورد حضرت علی علیه السلام را تا ابد بر دیگران حرام دانستند؟',
            'option_a' => ' امام المتقین ',
            'option_b' => 'امیرالمومنین',
            'option_c' => 'امام المبین',
            'correct'=>'b',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => ' حضرت رسول صلی لله علیه و اله شک درمورد هر یک از امامان علیهم السلام را به چه معنا می دانند؟',
            'option_a' => 'فقد کفر کفر الجاهلیه الاولی',
            'option_b' => 'فقد شک فی کل ما انزل الی',
            'option_c' => 'فقد شک فی الکل منهم',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => 'حضرت رسول صلوات الله علیه و آله چه لقبی در مورد حضرت علی علیه السلام را تا ابد بر دیگران حرام دانستند؟',
            'option_a' => 'امام المتقین',
            'option_b' => 'امیرالمومنین ',
            'option_c' => ' جنب الله',
            'correct'=>'b',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => ' همراهی و عدم جدایی ثقل اکبر و اصغر تا کجا بیان شده است؟',
            'option_a' => 'الی الابد',
            'option_b' => 'تا قیامت ',
            'option_c' => 'تا ورود بر پیامبر صلوات الله علیه و آله در حوض کوثر ',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title'=>'در قران کریم درباره ی  ستیزکنندگان با امیرالمومنین علیه السلام امده است که انها در حق چه کسی کوتاهی می کنند؟',
            'option_a' => ' جنب الله',
            'option_b' => '  وجه الله  ',
            'option_c' => ' ید الله',
            'correct'=>'a',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title'=>'خداوند توبه چه کسی را هرگز نمی پذیرد؟',
            'option_a' => 'کسی که فضائل امیرالمومنین علیه السلام را نشر ندهد',
            'option_b' => ' کسی که بسیار توبه شکسته باشد ',
            'option_c' => ' کسی که ولایت امیرالمومنین علیه السلام را انکار کند',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title'=>'پیامبر صلی الله علیه و اله و سلم کسی که افضل بودن حضرت علی علیه السلام بعد از ایشان را انکار کند با چه صفتی معرفی نموده اند؟',
            'option_a' => 'ملحد',
            'option_b' => ' ملعون ',
            'option_c' => ' مکار',
            'correct'=>'b',
            'stage_id'=> 2
        ]);

        ######################## stage 3

        DB::table('stages')->insert([
            'title' => 'مرحله سوم',
            'passage' => 'بخش پنجم: تاکید بر توجه امت به مسئله امامت￼
            َمعاِشَرالنّاِس،ِإن ماأَْکَمَل  َع زَوَج لدینَُکْمِبِإماَمِتِه.فََمْنلَْمَیأْتَ مِبِهَوِبَمْنَیقُوُمَمقاَمهُِمْنُوْلدیِمْن ُصْلِبِهِإلیَیْوِماْلِقیاَمِة َو ا ْل َع ْر ِض َع ل َ ی   َع  ز َو َج  ل ف َ أ ُ و ل ِئ َک ا ل   ذ ی َن َح ِب َط ْت أ َ ْع م ا ل ُ ُه ْم ( ِف ی ا ل د   ْن ی ا َو ا ْ  ِخ َر ِة ) َو ِف ی ا ل ن ّ ا ِر ُه ْم خ ا ِل د ُ و َن ، (   ی ُ َخ ف   ُف َع ْن ُه ُم ا ْل َع ذ ا ُب َو   ُه ْم ی ُ ْن َظ ر و َن ) .
            هان مردمان! خداوند ع ّزوج ّل دین را با امامت علی تکمیل فرمود. اینک آنان که از او و جانشینانش از فرزندان من و از
            نسل او - تا برپایی رستاخیز و عرضه ی بر خدا - پیروی نکنند، در دو جهان کرده هایشان بیهوده بوده در آتش دوزخ￼ ابدی خواهند بود، به گونه ی که نه از عذابشان کاسته و نه برایشان فرصتی خواهد بود.
            َمعاِشَرالنّاِس،هذا َعِلی،أَْن َصُرُکْملیَوأََحق ُکْمبیَوأَْقَربُُکْمِإلَیَوأََع زُکْم َعلَی،َو  َع زَوَج لَوأَنَاَعْنهُراِضیاِن.َومانََزلَْت آ َی ة ُ ِر ض ا ً ( ف ی ا ْل ق ُ ْر آ ِن ) ِإ   ّ ف ی ِه ، َو   خ ا َط َب   ا ل   ذ ی َن آ َم ن ُ و ا ِإ   ّ َب د َ أ ِب ِه ، َو   ن َ َز ل َ ْت آ َی ة ُ َم د ْ ح ٍ ِف ی ا ْل ق ُ ْر آ ِن ِإ   ّ ف ی ِه ، َو   َش ِه د َ   ِبا ْل َجن  ِة فی ( َه ْل أَتی َعلَی ا ْ ِ  ْنسا ِن) ِإ ّلَهُ، َو  أَ ْن َزلَها فی ِسواهُ َو  َمدَ َح ِبها َغ ْی َرهُ.
            هان مردمان! این علی یاورترین، سزاوارترین و نزدیک ترین و عزیزترین شما نسبت به من است. خداوند ع ّزوج ّل و من از او خشنودیم. آیه رضایتی در قرآن نیست مگر این که درباره ی اوست. و خدا هرگاه ایمان آوردگان را خطابی نموده به او آغاز کرده [و او اولین شخص مورد نظر خدی متعال بوده است ] . و آیه ی ستایشی نازل نگشته مگر درباره ی او. و خداوند در سوره ی «هل أتی علی ا نسان» گواهی بر بهشت [رفتن ] نداده مگر بری او، و آن را در حق غیر او نازل نکرده و به آن جز او را نستوده است.
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ُه َو ن ا ِص ُر د ی ِن   َو ا ْل ُ ُ م ج ا ِد ُل َع ْن َر ُس و ِل   ، َو ه ُ َو ا ل ت   ِق ی ا ل ن   ِق ی ا ْل ه ا ِد ی ا ْل َم ْه ِد ی . ن َ ِب ی   ُک ْم َخ ْی ُر ن َ ب ی َو َو ِص ی   ُک ْم
            َخ ْی ُر َو ِص ی ( َو َب ن ُ و ه ُ َخ ْی ُر ا ْ  َ ْو ِص ی ا ِء ) .￼ َم ع ا ِش َر ا ل ن ّ ا ِس ، ذ ُ ِ ّر ی   ة ُ ُک ِ ّل ن َ ِب ی ِم ْن ُص ْل ِب ِه ، َو ذ ُ ِ ّر ی   ت ی ِم ْن ُص ْل ِب ( أ َ م ی ِر ا ْل ُم ْؤ ِم ن ی َن ) َع ِل ی .
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ِإ  ن ِإ ْب ل ی َس أ َ ْخ َر َج آ د َ َم ِم َن ا ْل َج ن   ِة ِب ا ْل َح َس ِد ، ف َ   ت َ ْح ُس د ُ و ه ُ ف َ ت َ ْح ِب َط أ َ ْع م ا ل ُ ُک ْم َو ت َ ِز  ل أ َ ْق د ا ُم ُک ْم ، ف َ ِإ  ن آ د َ َم أ ُ ْه ِب َط ِإ ل َ ی اْ َرِضِبَخطیئٍَةواِحدٍَة،َوُهَو َصْفَوةُ َع زَوَج ل،َوَکْیَفِبُکْمَوأَْنتُْمأَْنتُْمَوِمْنُکْمأَْعداُء ،
            أَ َوِإن هُ یُْبِغ ُض َعِلیّاًِإ َّشِقی،َو یُوالی َعِلیّاًِإ  تَِقی،َو یُْؤِمُنِبِهِإ ُّمْؤِمٌنُمْخِل ٌص.
            هان مردمان! او یاور دین خدا و دفاع کننده ی از رسول اوست. او پرهیزکار پاکیزه و رهنمی ارشاد شده [به دست خود خدا] است. پیامبرتان برترین پیامبر، وصی او برترین وصی و فرزندان او برترین اوصیایند.
            هان مردمان! فرزندان هرپیامبر از نسل اویند و فرزندان من از صلب و نسل امیرالمؤمنین علی است.￼
            هان مردمان! به راستی که شیطا ِن اغواگر، آدم را با رشک از بهشت رانده مبادا شما به علی رشک ورزید که کرده هایتان نابود و گام هایتان لغزان خواهدشد. آدم به خاطر یک اشتباه به زمین هبوط کرد و حال آن که برگزیده ی خدی ع ّزوج ّل بود. پس چگونه خواهید بود شما و حال آن که شما شمایید و دشمنان خدا نیز از میان شمایند.
            آگاه باشید! که با علی نمی ستیزد مگر بی سعادت. و سرپرستی او را نمی پذیرد مگر رستگار پرهیزگار. و به او نمی￼ گرود مگر ایمان دار بی آ یش.
            َو ف ی َع ِل ی - َو   - ن َ َز ل َ ْت ُس و ر ة ُ ا ْل َع ْص ر : ( ب ْس م   ا ل  ر ْح م ا ن ا ل  ر ح ی م ، َو ا ْل َع ْص ر ، إ  ن ا ْ  ْن س ا َن ل َ ف ی ُخ ْس ر ) ( إ   ّ َع ل ی ّ ا ً ا ل ّ ذ ی آ م َن َو￼ ٍََِِِِِِِِ
            َ ر ِ ض ی ِ ب ا ْ ل َ ح ّ ق َ و ا ل  ص ْ ب ِ ر ) . ِ
            َمعاِشَرالنّاِس،قَِداْستَْشَهدُْت َوَبل ْغتُُکْمِرسالَتیَوما َعلَیال رُسوِلِإ  اْلَب ُغاْلُمبیُن. َمعا ِش َرالنّا ِس، (إت قُو  َح  ق تُقا ِت ِه َو تَموتُ  ن ِإ ّ َوأَ ْنتُ ْم ُم ْس ِل ُمو َن). و سوگند به خدا که سوره ی والعصر درباره ی اوست: «به نام خداوند همه مهر مهر ورز. قسم به زمان که انسان در
            زیان است.» مگر علی که ایمان آورده و به درستی و شکیبایی آراسته است.
            هان مردمان! خدا را گواه گرفتم و پیام او را به شما رسانیدم. و بر فرستاده وظیفه ی جز بیان و اب غ روشن نباشد!￼ هان مردمان! تقوا پیشه کنید همان گونه که بایسته است. و نمیرید جز با شر ِف اس م.
            بخش ششم: اشاره به کارشکنی های منافقین
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ( آ ِم ن ُ و ا ِب ا   َو َر ُس و ِل ِه َو ا ل ن   و ِر ا ل   ذ ی أ ُ ْن ِز َل َم َع ه ُ ِم ْن ق َ ْب ِل أ َ ْن ن َ ْط ِم َس ُو ُج و ه ا ً ف َ ن َ ُر د   ه ا َع ل ی أ َ د ْ ب ا ِر ه ا أ َ ْو ن َ ْل َع ن َ ُه ْم َک م ا ل َ َع ن   ا أ َ ْص ح ا َب ا ل  س ْب ِت ) . ( ب ا   م ا َع ن ی ِب ه ِذ ِه ا ْ  َی ِة ِإ     ق َ ْو م ا ً ِم ْن أ َ ْص ح ا ب ی أ َ ْع ِر ف ُ ُه ْم ِب أ َ ْس م ا ِئ ِه ْم َو أ َ ْن س ا ِب ِه ْم ، َو ق َ د ْ أ ُ ِم ْر ُت ِب ا ل  ص ْف ح ِ َع ْن ُه ْم ف َ ْل َی ْع م ْل ُک  ل ا ْم ر ئ َع ل ی م ا َی ج د ُ ِل َع ِل ی ف ی ق َ ْل ب ِه ِم َن ا ْل ُح ّب َو ا ْل ب ُ ْغ ِض ) .
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ا ل ن   و ُر ِم َن   َع  ز َو َج  ل َم ْس ل و ٌک ف ِ ی ث ُ  م ف ی َع ِل ی ْب ِن أ َ ب ی ط ا ِل ٍب ، ث ُ  م ِف ی ا ل  ن ْس ِل ِم ْن ه ُ ِإ ل َ ی ا ْل ق ا ِئ ِم ا ْل َم ْه ِد ی ا  ل ذ ی َی أ ْ ُخ ذ ُ
            ِ ب َ ح ّ ق   َ و ِ ب ُ ک ِ ّ ل َ ح ّ ق ُ ه َ و ل َ ن ا ، ِ   َ ُ   ن   َ ع   ز َ و َ ج   ل ق َ د ْ َ ج َ ع ل َ ن ا ُ ح   ج ة ً َ ع ل َ ی ا ْ ل ُ م ق َ ِ ّص ر ی َ ن َ و ا ْ ل م ع ُ ا ِ ن د ی َ ن َ و ا ْ ل ُ ُ م خ ا ِ ل ف ی َ ن َ و ا ْ ل خ ا ِ ئ ن ی َ ن ِ
            ٍَِِِِ
            َوا ْ  ِثمی َن َوالّ َظا ِلمی َن َوا ْلغا ِصبی َن ِم ْن َجمی ِع ا ْلعالَمی َن.￼
            هان مردمان! «به خدا و رسول و نور همراهش ایمان آورید پیش از آن که چهره ها را تباه و باژگونه کنیم یا چونان اصحاب روز شنبه [یهودیانی که بر خدا نیرنگ آوردند] رانده شوید.«به خدا سوگند که مقصود خداوند از این آیه گروهی از صحابه اند که آنان را با نام و نَ َسب می شناسم لیکن به پرده پوشی کارشان مأمورم. آنک هر کس پایه کار خویش را مهر و یا خشم علی در دل قرار دهد [و بداند که ارزش عمل او وابسته به آن است.] .
            مردمان! نور از سوی خداوند ع ّزوجل در جان من، سپس در جان علی بن ابی طالب، آن گاه در نسل او تا قائم مهدی - که حق خدا و ما را می ستاند - جی گرفته. چرا که خداوند ع ّزوجل ما را بر کوتاهی کنندگان، ستیزه گران، ناسازگاران، خائنان و گنهکاران و ستمکاران و غاصبان از تمامی جهانیان دلیل و راهنما و حجت آورده است.
            َمعاِشَرالنّاِس،أُْنِذُرُکْمأَنّیَرُسوُل قَدَْخلَْتِمْنقَْبِلیال رُسُل،أَفَِإْنِم تأَْوقُِتْلُتاْنقَلَْبتُْم َعلیأَْعقاِبُکْم؟َوَمْنَیْنقَِلْب َعلی￼ َع ِق َب ْی ِه ف َ ل َ ْن ه ا ن َی ُض  ر   َش ْی ئ ا ً َو َس َی ْج ِز ی   ا ل ّش ا ِک ر ی َن ( ا ل ّص ا ِب ر ی َن ) . أ َ   َو ِإ  ن َع ِل ی ّ ا ً ُه َو ا ْل َم ْو ُص و ُف ِب ا ل  ص ْب ِر َو ا ل  ش ْک ِر ، ث ُ  م ِم ْن َب ْع ِد ِه ُوْلدیِمْن ُصْلِبِه.
            َمعاِشَرالنّاِس، تَُمن وا َعلَیِبِإْس ِمُکْم،َبْل تَُمن وا َعلَی فَیُْحِبَط َعَمَلُکْمَوَیْسَخَط َعلَْیُکْمَوَیْبتَِلَیُکْمِبُشواٍظِمْنناٍر
            َو ن ُ ح ا ٍس ، ِإ  ن َر ب   ُک ْم ل َ ِب ا ا ْل ِم ْر ص ا ِد .￼
            هان مردمان! هشدارتان می دهم: همانا من رسول خدایم. پیش از من نیز رسو نی آمده و سپری گشته اند. آیا اگر من￼ بمیرم یا کشته شوم، به جاهلیت عقب گرد می کنید؟ آن که به قهقرا برگردد، هرگز خدا را زیانی نخواهد رسانید و خداوند سپاسگزاران شکیباگر را پاداش خواهد داد. بدانید که علی و پس از او فرزندان من از نسل او، داری کمال شکیبایی و سپاسگزاری اند.
            هان مردمان! اس متان را بر من منت نگذارید؛ که اعمال شما را بیهوده و تباه خواهد کرد و خداوند بر شما خشم خواهد گرفت و سپس شما را به شعله ی از آتش و مس گداخته گرفتار خواهد نمود. همانا پروردگار شما در کمین گاه است.
            َمعا ِش َرالنّا ِس، ِإن هُ َس َی ُکو ُن ِم ْن َب ْعدی أَئ  مةٌ َیدْ ُعو َن ِإلَی النّا ِر َو َی ْو َم ا ْل ِقیا َم ِة  یُ ْن َصرو َن. َمعا ِش َرالنّا ِس، ِإ  ن   َوأَنَا َبریئا ِن
            ِم ْن ُه ْم .￼
            معا ِشرالنّا ِس، إن  ُه ْم َوأَ ْنصار ُه ْم َوأَتْبا َع ُه ْم َوأَ ْشیا َع ُه ْم ِفی الد  ْر ِک ا ْ َ ْس َفل ِم َن النّار َولَبئْس مثْ َوی ا ْل ُمتَ َکبّری َن. أَ  إن  ُه ْم أَ ْصحا ُب َََِ ََِِِِِِ
            ا ل  ص ح ی ف َ ِ ة ، ف َ ْ ل َ ی ْ ن ُ ظ ْ ر أ َ َ ح د ُ ُ ک ْ م ف ی َص ح ی ف َ ِ ت ِ ه ! !
            َمعا ِش َرالنّا ِس، ِإ ِنّی أَدَ ُعها ِإما َمةً َو ِوراثَةً (فی َع ِقبی ِإلی َی ْو ِم ا ْل ِقیا َم ِة)، َوقَدْ َبل  ْغ ُت ما أُ ِمر ُت ِبتَ ْبلی ِغ ِههان ُح  جةً َعلی ُک ِّل حا ِض ٍر
            َوغائٍبَو َعلیُکِّلأََحٍدِم مْن َشِهدَأَْولَْمَیْشَهدْ،ُوِلدَأَْولَْمیُولَْد،فَْلیَُبِلِّغاْلحاِضُراْلغاِئَبَواْلواِلدُاْلَوَلدَِإلیَیْوِماْلِقیاَمِة.
            َوَسَیْجَعلُوَناْ مامةََبْعدیُمْلکاًَواْغِتصاباً،(أَ لََعَن اْلغاصبیَناْلُمْغتَصبیَن)،َوِعْندَها َسَیْفُرُغلَُکْمأَی َهاالث قَ ن(مْن ََِِِ
            َی ْف َر ُغ ) َو ی ُ ْر ِس ُل َع ل َ ْی ُک م ا ُش و ا ٌظ ِم ْن ن ا ٍر َو ن ُ ح ا ٌس ف َ   ت َ ْن ت َ ِص ر ا ِن .
            مردمان! به زودی پس از من پیشوایانی خواهند بود که شما را به سوی آتش می خوانند و در روز رستاخیز تنها وبدون یاور خواهند ماند.
            هان مردمان! خداوند و من از آنان بیزاریم. هان مردمان! آنان و یاران و پیروانشان در بدترین جی جهنم، جایگاه متک ّبران خواهند بود. بدانید آنان اصحاب صحیفه
            اند. اکنون هر کس در صحیفه ی خود نظر کند.￼
            هان مردمان! اینک جانشینی خود را به عنوان امامت و وراثت به امانت به جی می گذارم در نسل خود تا برپایی روز رستاخیز. و حال، مأموریت تبلیغی خود را انجام می دهم تا برهان بر هر شاهد و غایب و بر آنان که زاده شده یا نشده اند و بر تمامی مردمان باشد. پس بایسته است این سخن را حاضران به غایبان و پدران به فرزندان تا برپایی رستاخیز
            برسانند. آگاه باشید! به زودی پس از من امامت را با پادشاهی جابه جا نموده. آن را غصب کرده و به تصرف خویش درآورند. هان! نفرین و خشم خدا بر غاصبان و چپاول گران! و البته در آن هنگام خداوند آتش عذاب - شعله هی آتش و مس
            گداخته - بر سر شما جن و انس خواهد ریخت. آن جاست که دیگر یاری نخواهید شد.￼
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ِإ  ن   َع  ز َو َج  ل ل َ ْم َی ُک ْن ِل َی ذ َ َر ُک ْم َع ل ی م ا أ َ ْن ت ُ ْم َع ل َ ْی ِه َح ت ّ ی َی م ی َز ا ْل َخ ب ی َث ِم َن ا ل  ط ِ ّی ِب ، َو م ا ک ا َن   ِل ُی ْط ِل َع ُک ْم َع ل َ ی ا ْ ل غ َ ْ ی ِب .
            معاِشرالنّاِس،إن هُماِمْنقَْرَیٍةإ َّو ُمْهِلُکهابتَْکذیبهاقَْبَلَیْوماْلِقیامِةَوُممِلُّکَهااْ ماماْلمْهِدیَو ُم َصِدٌّقَوْعدَهُ. ََََََِِِِِِ
            َ م ع ا ِ ش َ ر ا ل ن ّ ا ِ س ، ق َ د ْ َض   ل ق َ ْ ب ل َ ُ ک ْ م أ َ ْ ک ث َ ُ ر ا ْ   َ   و ل ی َ ن ، َ و   ل َ ق َ د ْ أ َ ْ ه ل َ َک ا ْ   َ   و ل ی َ ن ، َ و ُ ه َ و ُ م ْ ه ِ ل ُک ا ْ   ِ خ ر ی َ ن .￼
            هان مردمان! هر آینه خداوند عزوجل شما را به حالتان رها نخواهد کرد تا ناپاک را ازپاک جدا کند. و خداوند نمی￼ خواهد شما را بر غیب آگاه گرداند. (اشاره به آیه ی 179 / آل عمران است.)
            هان مردمان! هیچ سرزمینی نیست مگر این که خداوند به خاطر تکذیب اهل آن [حق را] ، آنان را پیش از روز رستاخیز نابود خواهد فرمود و به امام مهدی خواهد سپرد. و هر آینه خداوند وعده ی خود را انجام خواهد داد.
            هان مردمان! پیش از شما، شمار فزونی از گذشتگان گمراه شدند و خداوند آنان را نابود کرد. و همو نابودکننده ی آیندگان است.
            قاَل تَعالی:(أَلَْمنُْهِل ِکاْ َ ولیَن،ثُ منُتِْبعُُهُماْ ِخریَن،کذاِل َکنَْفَعُلِباْلُمْجِرمیَن،َوْیٌلَیْوَمِئٍذِلْلُمَکِذّبیَن).
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ِإ  ن   ق َ د ْ أ َ َم َر ن ی َو ن َ ه ا ن ی ، َو ق َ د ْ أ َ َم ْر ُت َع ِل ی ّ ا ً َو ن َ َه ْی ت ُ ه ُ ( ِب أ َ ْم ِر ِه ) . ف َ ِع ْل ُم ا ْ  َ ْم ِر َو ا ل ن   ُه ی ل َ د َ ْی ِه ، ف َ ا ْس َم ع ُ و ا ِ  َُ ْم ِر ِه￼ تَ ْسلَ ُموا َوأَطیعُوهُ تَ ْهتَدُوا َوا ْنتَ ُهوا ِلنَ ْه ِی ِه تَر ُشدُوا، ( َوصی ُروا ِإلی ُمرا ِد ِه) َو  تَتَفَ  ر ْق ِب ُک ُم ال  سبُ ُل َع ْن َسبی ِل ِه.
            او خود در کتابش آورده: «آیا پیشینیان را تباه نکردیم و به دنبال آنان آیندگان را گرفتار نساختیم؟ با مجرمان این چنین کنیم. وی بر ناباوران!»
            هان مردمان! همانا خداوند امر و نهی خود را به من فرموده و من نیز به دستور او دانش آن را نزد علی نهادم. پس فرمان او را بشنوید و گردن نهید و پیرویش نمایید و از آنچه بازتان دارد خودداری کنید تا راه یابید. به سوی هدف او حرکت کنید. راه هی گونه گون شما را از راه او بازندارد!',

        ]);
        DB::table('questions')->insert([
            'title' => ' در جای خالی کدام کلمات قراردارند؟ (الا و انه لایبغض علیا الا.... ولا یوالی علیا الا.....ولا یومن به الا....)',
            'option_a' => 'ملعون_مومن مخلص_تقی',
            'option_b' => ' شقی_تقی_مومن مخلص',
            'option_c' => 'هر دو مورشقی_مومن مخلص_تقی',
            'correct'=>'b',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title' => 'طبق فرمایش حضرت رسول صلی الله علیه و اله و سلم کدام سوره در شان امیرالمؤمنین علیه السلام نازل شده است؟',
            'option_a' => ' سوره ملک',
            'option_b' => 'سوره توحید ',
            'option_c' => ' سوره عصر',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title' => 'پیامبر صلوات الله علیه و آله با اشاره به علت رانده شدن آدم از بهشت توسط شیطان اغواگر، از چه امری نسبت به حضرت علی علیه السلام نهی می نمایند؟ ',
            'option_a' => 'دشمنی ',
            'option_b' => 'کینه توزی',
            'option_c' => 'حسد ',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title'=>'پیامبر صلی الله علیه و اله و سلم با اشاره به علت رانده شدن ادم از بهشت توسط شیطان اغواگر، از چه امری نسبت به حضرت علی علیه السلام نهی می نمایند؟ ',
            'option_a' => ' حسد',
            'option_b' => '  کینه توزی ',
            'option_c' => 'دشمنی و عداوت',
            'correct'=>'a',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title'=>' کسانی که بخاطر اسلام اوردن خود بر رسول صلی الله علیه و اله و سلم منت گذارند به چه سزایی دچار می شوند؟',
            'option_a' => ' حبط اعمال',
            'option_b' => ' خشم خدا ',
            'option_c' => 'هردو مور',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title'=>'پیامبر صلی الله علیه و اله و سلم در این بخش از خطبه ی شریف از چه افرادی اعلام بیزاری می نمایند؟',
            'option_a' => 'متکبرین',
            'option_b' => '  پیشوایان دعوت کننده به اتش ',
            'option_c' => 'افراد سست ایمان و زودباور',
            'correct'=>'b',
            'stage_id'=> 3
        ]);

        ######################## stage 4

        DB::table('stages')->insert([
            'title' => 'مرحله چهارم',
            'passage' => 'بخش هفتم: پیروان اهل بیت علیهم الس م و دشمنان ایشان￼
            َمعاِشَرالنّاِس،أََناِصراُط اْلُمْستَقیُما لذیأََمَرُکْمِباِتّباِعِه،ثُ مَعِلیِمْنَبْعدی.ثُ مُوْلدیِمْن ُصْلِبِهأَِئ مةُ(اْلُهدی)،َیْهدوَن
            إ ل َ ی ا ْل َح ّق َو ب ِه َی ْع ِد ل و َن . ِِِ
            ث ُ  م ق َ َر أ َ : « ِب ْس ِم   ا ل  ر ْح م ا ِن ا ل  ر ح ی ِم ا ْل َح ْم د ُ ِ     ِ َر ِب ا ْل ع ا ل َ م ی َن . . . » ِإ ل ی آ ِخ ِر ه ا ،
            هان مردمان! صراط مستقیم خداوند منم که شما را به پیروی آن امر فرموده. و پس از من علی است و آن گاه فرزندانم￼ از نسل او، پیشوایان راه راستند که به درستی و راستی راهنمایند و به آن حکم و دعوت کنند.
            سپس پیامبر صلّی   علیه و آله قرائت فرمود: «بسم   ال ّرحمن ال ّرحیم الحمد ّ  ر ّب العالمین ال ّرحمن ال ّرحیم» - تا آخر سوره.
            َوقاَل:فِینََزلَْتَوفیِهْم(َو )نََزلَْت،َولَُهْم َع مْتَوِإی اُهْم َخ  صْت،أُولئ َکأَْوِلیاُء ال ذیَن َخْوٌف َعلَْیِهْمَو ُهْمَیْحَزنوَن،أَ  ِإ  ن ِح ْز َب   ُه ُم ا ْلغا ِلبُو َن. أَ  ِإ  ن أَ ْعدائَ ُه ْم ُه ُم ال  سفَها ُءا ْلغا ُوو َن ِإ ْخوا ُن ال  شیاطی ِن یوحی َب ْع ُض ُه ْم ِإلی َب ْع ٍض ُز ْخ ُر َف ا ْلقَ ْو ِل ُغروراً.أَ ِإ نأَْوِلیائَُهُمال ذیَنذََکَرُهُم فیِکتاِبِه،فَقاَل َع زَوَج ل:( تَِجدُقَْوماًیُؤِمنُوَنِبا َواْلَیْوِماْ ِخِریُواد وَنَمْن حاد   َو َر ُسولَهُ َولَ ْوکانُوا آبائَ ُه ْم أَ ْوأَ ْبنائَ ُه ْم أَ ْو ِإ ْخوانَ ُه ْم أَ ْو َعشی َرتَ ُه ْم، أُول ِئ َک َکتَ َب فی قُلو ِب ِه ُم ا ْ یما َن) ِإلی آ ِخرا  َی ِة.
            هان! به خدا سوگند این سوره درباره ی من نازل شده و شامل امامان می باشد و به آنان اختصاص دارد. آنان اولیی خدایند که ترس و اندوهی برایشان نیست، آگاه باشید: البته حزب خدا چیره و غالب خواهد بود. هشدار که: ستیزندگان با امامان، گمراه و همکاران شیاطین اند. بری گمراهی مردمان، سخنان بیهوده و پوچ را به یکدیگر می رسانند. بدانید که خداوند از دوستان امامان در کتاب خود چنین یاد کرده: «[ی پیامبر ما] نمی یابی ایمانیان به خدا و روز بازپسین، که
            ستیزه گران خدا و رسول را دوست ندارند، گرچه آنان پدران، برادران و خویشانشان باشند. آنان [که چنین اند] خداوند￼ ایمان را در دل هایشان نبشته است.» - تا آخر آیه.
            أَ ِإ نأَْوِلیائَُهُماْلُمْؤِمنوَنا لذیَنَو َصفَُهُم  َع زَوَج لفَقاَل:(ال ذیَنآَمنُواَولَْمَیْلِبُسواإیمانَُهْمِبُظْلٍمأُولِئ َکلَُهُماْ َْمُنَو ُهْم ُم ْهتَدو َن).
            (أَ  ِإ  ن أَ ْو ِلیائَ ُه ُم ا  لذی َن آ َمنُوا َولَ ْم َی ْرتابوا). أَ  ِإ  ن أَ ْو ِلیائَ ُه ُم ا  لذی َن یدْ ُخلو َن ا ْل َجن ةَ ِب َس  ٍم آ ِمنی َن، تَتَلَقّا ُه ُم ا ْل َم  ِئ َکةُ ِبالت  ْسلی ِم َیقُولو َن: َس  ٌم َعلَ ْی ُک ْم ِط ْبتُ ْم فَادْ ُخلوها خا ِلدی َن. أَ  ِإ  ن أَ ْو ِلیائَ ُه ْم، لَ ُه ُم ا ْل َجن ةُ یُ ْر َزقو َن فیها ِبغَ ْی ِر ِحسا ٍب. أَ  ِإ  ن أَ ْعدائَ ُه ُم ال ذی َن َی ْصلَو َن َسعیراً.
            أَ ِإ نأَْعدائَُهُمال ذیَنَیْسَمعوَنِلَجَهن َم َشهیقاًَو ِهیتَفوُرَوَیَرْوَنلَهاَزفیراً.￼
            أَ  ِإ  ن أَ ْعدائَ ُه ُم ال ذی َن قا َل   فی ِه ْم: ( ُکل ما دَ َخلَ ْت أُ  مةٌ لَ َعنَ ْت أُ ْختَها) ا یة.
            أَ ِإ نأَْعدائَُهُمال ذیَنقاَل  َع زَوَج ل:(ُکل ماأُْلِقیفیهافَْوٌج َسأَلَُهْم َخَزنَتُهاأَلَْمَیأِتُکْمَنذیٌر،قالواَبلیقَدْجاَءناَنذیٌرفََکذ ْبنا
            َُ َُّْْْ ًَََ َ َ 
            َوقلنامانز َل  ِمن َشی ٍء ِإنأنتْم ِإ فی َض  ٍل َکبیٍر) ِإلیقوله:(أ ف ُس ْحقا ِ  َ ْصحا ِبال  سعیِر).أ  ِإنأْوِلیائَ ُهُمالذی َن
            َی ْخ َش ْو َن َر ب   ُه ْم ِب ا ْل غ َ ْی ِب ، ل َ ُه ْم َم ْغ ِف َر ة ٌ َو أ َ ْج ٌر َک ب ی ٌر .
            هان! دوستداران امامان ایمانیان اند که قرآن چنان توصیف فرموده: «آنان که ایمان آورده و باور خود را به شرک￼ نیالوده اند، در امان و در راه راست هستند.»
            هشدار! یاران پیشوایان کسانی هستند که به باور رسیده و از تردید و انکار دور خواهند بود.
            هشدار! اولیی امامان آنانند که با آرامش و س م به بهشت درخواهند شد و فرشتگان با س م آنان را پذیرفته، خواهند گفت: «درود بر شما که پاک شده اید. اینک داخل شوید که در بهشت، جاودانه خواهید بود.»
            هان! بهشت پاداش اولیی آنان است و در آن بی حساب روزی داده خواهند شد.
            هان! دشمنان آنان آن کسانی اند که در آتش درآیند. و همانا ناله ی افروزش جهنم￼ را می شنوند در حالی که شعله هی آتش زبانه می کشد و زفیر (صدی بازدم) جهنم را نیز درمی یابند. هان! خداوند درباره ی ستیزگران با آنان فرموده: «هرگاه امتی داخل جهنم شود همتی خود را نفرین کند.»
            هشدار! که دشمنان امامان همانانند که خداوند درباره ی آنان فرموده: «هر گروهی از آنان داخل جهنم شود نگاهبانان می پرسند: مگر برایتان ترساننده ی نیامد؟! می گویند: چرا ترساننده آمد لیکن تکذیب کردیم و گفتیم: خداوند وحی نفرستاده و شما نیستید مگر در گمراهی بزرگ!» تا آن جا که فرماید: «هان! نابود باد دوزخیان!»
            هان! یاران امامان در نهان، از پروردگار خویش ترسانند، آمرزش و پاداش بزرگ بری آنان خواهد بود. هان مردمان! چه بسیارراه است میان آتش و پاداش بزرگ! َمعاِشَرالنَاِس، َشتّاَنماَبْیَنال سعیِرَواْ َْجِراْلَکبیِر. ( َمعا ِش َرالنّا ِس)، َعدُ  ونا َم ْن ذَ  مهُ   َولَ َعنَهُ، َو َو ِلی نا ( ُک  ل) َم ْن َمدَ َحهُ   َو أَ َحب هُ.
            َمعا ِش َر النّا ِس، أَ  َو ِإنّی (أَنَا) الن ذی ُر و َع ِلی ا ْل َبشی ُر.￼
            (َمعا ِشَرالنّا ِس)،أَ  َو ِإِنّی ُمْنِذٌر َو َعِلیهاٍد.
            َمعا ِش َر النّاس (أَ ) َو ِإنّی نَبی َو َع ِلی َو ِصیّی.
            (معاِشرالنّاِس،أَ َوإِنّیرسوٌلَو َعِلیاْ ماُمَواْلَوصیِمْنَبْعدی،َواْ َِئ مةُِمْنَبْعِدِهُوْلدُهُ.أَ َوإنّیواِلدُُهْمَوُهْمَیْخُرجوَنِمْن َََِِِ ِ
            ُص ْ ل ِ ب ِ ه ) .
            هان مردمان! خداوند ستیزه جویان ما را ناستوده و نفرین فرموده و دوستان ما را ستوده و دوست دارد.
            هان مردمان! بدانید که همانا من انذارگرم و علی مژده دهنده.￼ هان! که من بیم دهنده ام و علی راهنما. هان مردمان! بدانید که من پیامبرم و علی وصی من است. هان مردمان! بدانید که همانا من فرستاده و علی امام و وصی پس از من است. و امامان پس از او فرزندان اویند. آگاه باشید! من والد آنانم ولی ایشان از نسل علی خواهند بود.
            بخش هشتم: حضرت مهدی عجل   فرجه الشریف￼
            أَ  ِإ  ن خاتَ َم ا ْ َ ِئ َم ِة ِمن ا ا ْلقا ِئ َم ا ْل َم ْه ِدی. أَ ِإن هُالّظاِهُر َعلَیالِدّیِن. أَ  ِإن هُ ا ْل ُم ْنتَ ِق ُم ِم َن ال ّظا ِلمی َن. أ َ   ِ إ ن   ه ُ ف ا ِ ت ُ ح ا ْ ل ُ ح ُص و ِ ن َ و ه ا ِ د ُ م ه ا .
            أَ  ِإن هُ غا ِل ُب ُک ِّل قَبیلَ ٍة ِم ْن أَ ْه ِل ال ِّش ْر ِک َوهادیها.￼ أ َ   ِ إ ن   ه ُ ا ْ ل ُ م د ْ ِ ر ُک ِ ب ُ ک ِ ّ ل ث ا ٍ ر ِ   َ َ ْ و ِ ل ی ا ِ ء   . أَ  ِإن هُ النّا ِص ُر ِلدی ِن  . أَ ِإن هُاْلغَّراُفِمْنَبْحٍر َعمیٍق. أ َ   ِ إ ن   ه ُ َ ی ِ س ُ م ُ ک   ل ذ ی ف َ ْض ٍ ل ِ ب ف َ ْض ِ ل ِ ه َ و ُ ک   ل ذ ی َ ج ْ ه ٍ ل ِ ب َ ج ْ ه ِ ل ِ ه . أَ  ِإن هُ ِخ َی َرةُ  َو ُم ْختا ُرهُ. أَ  ِإن هُواِر ُث ُک ِّل ِعْلٍم َوا ْل َُمحی ُط ِب ُک ِّلفَ ْهٍم.
            أَ إن هُاْلَُمْخبُر َعْنربِّه َع زَوَج ل َواْلُم َشیّدُ ِ َْمرآیاِتِه. َِِِِِ
            أ َ   ِ إ ن   ه ُ ا ل   ر ش ی د ُ ا ل  س د ی د ُ .￼ أ َ   ِ إ ن   ه ُ ا ْ ل ُ م ف َ   و ُض ِ إ ل َ ْ ی ِ ه . أَ ِإن هُقَدَْب شَرِبِهَمْن َسَلَفِمَناْلقُروِنَبْیَنَیدَْیِه. أَ  ِإن هُ ا ْلباقی ُح  جةً َو  ُح  جةَ َب ْعدَهُ َو  َح  ق ِإ ّ َم َعهُ َو نُو َر ِإ ّ ِع ْندَهُ. أَ ِإن هُ غاِلَبلَهَُو َمْنصوَر َعلَْیِه. أَ َوِإن هُ َوِلی فیأَْر ِضِه، َو َح َکُمهُفی َخْلِقِه، َوأَمینُهُفی ِسِّرِه َوع نَِیِتِه. آگاه باشید! همانا آخرین امام، قائم مهدی از ماست. هان! او بر تمامی ادیان چیره خواهد بود.
            هشدار! که اوست انتقام گیرنده از ستمکاران.￼ هشدار! که اوست فاتح دژها و منهدم کننده ی آنها. هشدار! که اوست چیره بر تمامی قبایل مشرکان و راهنمی آنان.
            هشدار! که او خونخواه تمام اولیی خداست.￼ آگاه باشید! اوست یاور دین خدا.
            هشدار! که از دریایی ژرف پیمانه هایی افزون گیرد.￼ هشدار! که او به هر ارزشمندی به اندازه ی ارزش او، و به هر نادان و بی ارزشی به اندازه ی نادانی اش نیکی کند. هشدار! که او نیکو و برگزیده ی خداوند است. هشدار! که او وارث دانش ها و حاکم بر ادراک هاست.
            هان! بدانید که او از سوی پروردگارش سخن می گوید و آیات و نشانه هی او را برپا کند. بدانید همانا اوست بالیده و استوار.
            بیدار باشید! هموست که [اختیار امور جهانیان و آیین آنان ] به او واگذار شده است.￼ آگاه باشید! که تمامی گذشتگان ظهور او را پیشگویی کرده اند.
            آگاه باشید! که اوست ح ّجت پایدار و پس از او ح ّجتی نخواهد بود.(2) درستی و راستی و نور و روشنایی تنها نزد اوست.
            هان! کسی بر او پیروز نخواهد شد و ستیزنده ی او یاری نخواهد گشت. آگاه باشید که او ولی خدا در زمین، داور او در میان مردم و امانتدار امور آشکار و نهان است.
            2) این تعبیر به عنوان ح ّجت و امامت است و نظری به رجعت دیگر امامان ندارد زیرا آنان ح ّجت های پیشین اند که دوباره رجعت خواهند نمود. ',

        ]);

        DB::table('questions')->insert([
            'title' => 'حضرت رسول صلی الله علیه و الهوا سلم پس از تلاوت کدام سوره فرمودند:"به خدا سوگند این سوره درباره من نازل شده و شامل امامان می باشد و به ان ها اختصاص دارد"؟',
            'option_a' => 'حمد  ',
            'option_b' => 'عصر ',
            'option_c' => 'یاسین  ',
            'correct'=>'a',
            'stage_id'=>4
        ]);
        DB::table('questions')->insert([
            'title' => 'تعابیر "اوست فاتح دژها و منهدم کننده ان ها" ،" وارث دانش ها و حاکم بر ادراک ها" ،"ولی خدا در زمین، داور او در میان مردم و امانتدار او در اشکارا و نهان" در باره چه کسی است؟',
            'option_a' => 'حضرت علی علیه السلام',
            'option_b' => 'امام زمان عج الله تعالی فرجه الشریف',
            'option_c' => 'هردو مورد',
            'correct'=>'b',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام آیه در وصف دشمنان اوصیای حضرت رسول صلوات الله علیه و آله نیست؟',
            'option_a' => 'هرگاه امتی داخل جهنم شود همتای خود را نفرین کند',
            'option_b' => 'دشمنان انان کسانی هستند که در اتش درایند و همانا ناله افروزش جهنم را می شنوند در حالیکه شعله های اتش زبانه می کشد و زفیر جهنم را نیز در می یابند',
            'option_c' => 'از پروردگار خویش ترسانند، امرزش و پاداش بزرگ برای انان خواهد بود',
            'correct'=>'c',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title' => ' "الذین یدخلون الجنه بسلام امنین" معرف چه کسانی است؟ ',
            'option_a' => ' شهدا و صالحین ',
            'option_b' => ' دوستداران امامان علیهم السلام',
            'option_c' => 'مجاهدان راه حق ',
            'correct'=>'b',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title'=>' کدام گزینه به این ویژگی در مورد حضرت مهدی عج الله تعالی فرجه الشریف اشاره دارد که ایشان خونخواه تمام اولیای الهی هستند؟',
            'option_a' => 'مدرک بکل ثار لاولیاالله',
            'option_b' => ' ناصر دین الله',
            'option_c' => 'غالب کل قبیله من اعلام الشرک',
            'correct'=>'a',
            'stage_id'=> 4
        ]);


        ######################## stage 5

        DB::table('stages')->insert([
            'title' => 'مرحله پنجم',
            'passage' =>'بخش نهم: مطرح کردن بیعت￼
            َمعا ِش َرالنّا ِس، ِإنّی قَدْ َبی  ْن ُت َل ُک ْم َوأَ ْف َه ْمتُ ُک ْم، َو هذا َع ِلی یُ ْف ِه ُم ُک ْم َب ْعدی. أَ  َو ِإ ِنّی ِع ْندَ ا ْن ِقضا ِء ُخ ْط َبتی أَدْ ُعو ُک ْم ِإلی ُمصافَقَتی َعلی َبْیَعِتِه َواِ ْقراِرِبِه،ثُ م ُمصافَقَِتِه َبْعدی.أَ َوِإن یقَدْباَیْع ُت  َو َعِلیقَدْباَیَعنی. َوأَنَاآِخذُُکْم ِباْلَبْیَعِةلَهُ َع ِن  َع زَوَج ل.(ِإ نال ذیَنیُباِیعُونَ َکِإن مایُباِیعُوَن ،َیدُ فَْوَقأَْیدیِهْم.فََمْننََکَثفَِإن ماَیْنُکُث َعلینَْفِسِه،َوَمْنأَْوفیِبما ع ا َه د َ َع ل َ ْی ه ُ   ف َ َس ی ُ ْؤ ت ی ِه أ َ ْج ر ا ً َع ظ ی م ا ً ) .
            هان مردمان! من پیام خدا را برایتان آشکار کرده تفهیم نمودم. و این علی است که پس از من شما را آگاه می کند. اینک￼ شما را می خوانم که پس از پایان خطبه با من و سپس با علی دست دهید تا با او بیعت کرده به امامت او اقرار نمایید. آگاه باشید من با خداوند و علی با من پیمان بسته و من اکنون از سوی خدی ع ّزوجل بری امامت او پیمان می گیرم. «[ی پیامبر ]آنان که با تو بیعت کنند هر آینه با خدا بیعت کرده اند. دست خدا بالی دستان آنان است. و هر کس بیعت شکند، بر زیان خود شکسته، و آن کس که بر پیمان خداوند استوار و باوفا باشد، خداوند به او پاداش بزرگی خواهد داد.
            بخش دهم: ح ل و حرام، واجبات و محرمات َمعاِشَرالنّاِس،ِإ ناْلَح جَواْلعُْمَرةَِمْن َشعائِر ،(فََمْن َح جاْلَبْیَتأَِواْعتََمَرفَ ُجناَح َعلَْیِهأَْنَی ط وَفِبِهما)ا َیة.
            َمعا ِش َرالنّا ِس، ُح  جواا ْل َب ْی َت، فَما َو َردَهُ أَ ْه ُل َب ْی ٍت ِإ   ا ْستَ ْغنَ ْوا َو أُ ْب ِشروا، َو تَ َخل فوا َع ْنهُ ِإ ّ َبتَ ُروا َو ا ْفتَقَ ُروا.￼
            َمعا ِش َرالنّا ِس، ما َوقَ َف ِبا ْل َم ْو ِق ِف ُم ْؤ ِم ٌن ِإ   َغفَ َر  لَهُ ما َسلَ َف ِم ْن ذَ ْن ِب ِه ِإلی َو ْق ِت ِه ذا ِل َک، فَ ِإذا ا ْنقَ َض ْت َح  جتُهُ ا ْستَأْ َن َف َع َملَهُ.
            َمعا ِش َرالن ا ِس، ا ْل ُح ّجا ُج ُمعانُو َن َو نَفَقاتُ ُه ْم ُم َخل فَةٌ َعلَ ْی ِه ْم َو   یُضی ُع أَ ْج َرا ْل ُم ْح ِسنی َن.
            َمعا ِش َرالنّا ِس، ُح  جوا ا ْل َب ْی َت ِب َکما ِل الدّی ِن َوالت فَق  ِه، َو تَ ْن َص ِرفُوا َع ِن ا ْلم َشا ِه ِد ِإ ّ ِبتَ ْو َب ٍة َو ِإ ْق عٍ.
            َمعاِشَرالنّاِس،أَقیُمواال  ص ةََوآتُواال زکاةََکماأََمَرُکُم  َع زَوَج ل،فَِإْنطاَل َعلَْیُکُماْ ََمدُفَقَ  صْرتُْمأَْونَِسیتُْمفََعِلیَوِلی ُکْم
            َوُمَبیٌّنلَُکْم،ا لذینَ َصَبهُ  َع زَوَج للَُکْمَبْعدیأَمیَن َخْلِقِه.إن هُِمِنّیَوأَنَاِمْنهُ،َو ُهَوَومْنتَْخلُُفِمْنذُّری تییُْخبرونَُکْم َِِِِ
            بماتَ ْسأَل ُو َن َع ْنهُ َویُ َبیّنُو َن لَ ُک ْم ما  تَ ْعلَ ُمو َن. ِِ
            هان مردمان! همانا حج و عمره از شعائر و آداب و رسوم خدایی است. پس زائران خانه ی خدا و عمره کنندگان بر صفا
            و مروه بسیار طواف کنند.￼
            هان مردمان! در خانه ی خدا حج گزارید؛ که هیچ خاندانی داخل آن نشد مگر بی نیاز شد و مژده گرفت، و کسی از آن روی برنگردانید مگر بی بهره و نیازمند گردید.
            هان مردمان! مؤمنی در موقف (عرفات، مشعر، منا) نمانَد مگر این که خدا گناهان گذشته ی او را بیامرزد و بایسته است که پس از پایان اعمال حج [با پرونده ی پاک ] کار خود را از سر گیرد.
            هان مردمان! حاجیان دستگیری شده اند و هزینه هی سفرشان جبران می شود و جایگزین آن به آنان خواهد رسید. و￼ البته خداوند پاداش نیکوکاران را تباه نخواهد کرد.
            هان مردمان! خانه ی خدا را با دین کامل و دانش ژرفی آن دیدار کنید و از زیارتگاهها جز با توبه و بازایستادن [از گناهان ] برنگردید.
            هان مردمان! نماز را به پا دارید و زکات بپردازید همان سان که خداوند ع ّزوجل امر فرموده. پس اگر زمان بر شما دراز شد و کوتاهی کردید یا از یاد بردید، علی صاحب اختیار و تبیین کننده ی بر شماست. خداوند ع ّزوجل او راپس از من امانتدار خویش در میان آفریدگانش نهاده. همانا او از من و من از اویم. و او و فرزندان من از جانشینان او، پرسش
            هی شما راپاسخ دهند و آن چه را نمی دانید به شما می آموزند.￼
            أَ ِإ ناْلَح َلَواْلَحراَمأَْکثَُرِمْنأَْنأُحِصَیُهماَوأَُعِّرفَُهمافَآُمَرِباْلَح ِلَواَنَهی َعِناْلَحراِمفیَمقاٍمواِحٍد،فَأُِمْرُتأَْنآُخذَ اْلَبْیَعةَِمْنُکْمَوال  صْفقَةَلَُکْمِبقَبُوِلماِجئُْتِبِه َعِن  َع زَوَج لفی َعِلیأمیِراْلُمْؤِمنیَنَوا َْوِصیاِءِمْنَبْعِدِهال ذیَن ُهْمِمِنّی َو ِم ْن ه ُ إ م ا َم ة ٌ ف ی ِه ْم ق ا ِئ َم ة ٌ ، خ ا ِت ُم ه ا ا ْل َم ْه د ی ِإ ل ی َی ْو ٍم َی ْل ق َ ی   ا ل   ذ ی ی ُ ق َ ِد ّ ُر َو َی ْق ض ی .
            َ م ع ا ِ ش َ ر ا ل ن ّ ا ِ س ، َ و ُ ک   ل َ ح   ٍ ل د َ ل َ ْ ل ت ُ ُ ک ْ م َ ع ل َ ْ ی ِ ه َ و ُ ک   ل َ ح ر ا ٍ م ن َ َ ه ْ ی ت ُ ُ ک ْ م َ ع ْ ن ه ُ ف َ ِ إ ِ ن ّ ی َ ل ْ م أ َ ْ ر ِ ج ْ ع َ ع ْ ن ذ ا ِ ل َک َ و َ ل ْ م أ ُ َ ب ِ د ّ ْ ل . أ َ   ف َ ا ذ ْ ُ ک ُ ر و ا ذ ا ِ ل َک
            َو ا ْح ف َ ُظ و ه ُ َو ت َ و ا َص ْو ا ب ِه ، َو   ت ُ َب ِد ّ ل ُ و ه ُ َو   ت ُ غ َ ی ّ ُر و ه ُ . أ َ   َو إ ِن ّ ی ا ُ َج ِد ّ د ُ ا ْل ق َ ْو َل : أ َ   ف َ أ َ ق ی ُم و ا ا ل  ص   ة َ َو آ ت ُ و ا ا ل  ز ک ا ة َ َو أ ْ ُم ُر و ا ب ا ْل م ْع ر و ِف َِِِِ
            َواْنَهْوا َعِناْلُمْنَکِر.
            هان! روا و ناروا بیش از آن است که من شمارش کنم و بشناسانم و در این جا یکباره به روا فرمان دهم و از ناروا بازدارم. از این روی مأمورم از شما بیعت بگیرم که دست در دست من نهید در مورد پذیرش آن چه از سوی خداوند آورده ام درباری علی امیرالمؤمنین و اوصیای پس از او که آنان از من و اویند. و این امامت به وراثت پایدار است و فرجام امامان، مهدی است و استواری امامت تا روزی است که او با خداوند قدر و قضا دیدار کند.
            هان مردمان! شما را به هرگونه روا و ناروا راهنمایی کردم و از آن هرگز برنمی گردم. بدانید و آگاه باشید! آن ها را￼ یاد کنید و نگه دارید و یکدیگر را به آن توصیه نمایید و در آن [احکام خدا] دگرگونی راه ندهید. هشدار که دوباره می گویم: بیدار باشید! نماز را به پا دارید. و زکات بپردازید. و امر به معروف کنید و از منکر بازدارید.
            أَ  َو ِإ  ن َرأْ َس ا ْ َ ْم ِر ِبا ْل َم ْع ُرو ِف أَ ْن تَ ْنتَ ُهوا ِإلی قَ ْولی َوتُ َب ِلّغُوهُ َم ْن لَ ْم َی ْح ُض ْر َو تَأْ ُمر ُوهُ ِبقَبُو ِل ِه َع ِنّی َوتَ ْن َه ْوهُ َع ْن ُمخالَفَ ِت ِه، فَ ِإن هُ أَْمٌرِمَن  َع زَوَج لَوِمنِّی.َو أَْمَرِبَمْعروٍفَو نَْهی َعْنُمْنکٍَرِإ  َمَعِإماٍمَمْعصوٍم.
            َمعاِشَرالنّاِس،اْلقُْرآُنیَُعِّرفُُکْمأَ ناْ َِئ مةَِمْنَبْعِدِهُوْلدُُه،َوَع رْفتُُکْمِإن ُهْمِمِنّیَوِمْنهُ، َحْیُثَیقُوُل فیِکتاِبِه:(َو َجَعلَها .raquo&َکِلَمةًباِقَیةًفی َعِقِبِه).َوقُْلُت:«لَْنتَِضل واماِإْنتََم سْکتُْمِبِهما
            َمعاِشَرالنّاِس،الت ْقوی،الت ْقوی،َواْحذَُرواالّساَعةََکماقاَل  َع زَوَج ل:(ِإ نَزْلَزلَةَالّساَعِة َشیٌء َعظیٌم).اُذُْکُروااْلَمماَت
            ( َوا ْلمعادَ) َوا ْل ِحسا َب َوا ْلموازی َن َوا ْل ُمحا َس َبةَ َب ْی َن َیدَی ر ّب ا ْلعالَمی َن َوالث وا َب َوا ْل ِعقا َب. فَم ْن جا َء با ْل َح َسنَ ِة أُثی َب َعلَ ْیها َو￼ ََََِِ
            م ْن جا َء بال  سیّئَ ِة فَلَ ْیس لَهُ ِفی الجنان نَصی ٌب. ََِِِِ
            و بدانید که ریشه ی امر به معروف این است که به گفته ی من [درباره ی امامت ] برسید و سخن مرا به دیگران برسانید و غایبان را به پذیرش فرمان من توصیه کنید و آنان را از ناسازگاری سخنان من بازدارید؛ همانا سخن من
            فرمان خدا و من است و هیچ امر به معروف و نهی از منکری جز با امام معصوم تحقق و کمال نمی یابد.￼
            هان مردمان! قرآن بر شما روشن می کند که امامان پس از علی فرزندان اویند و من به شما شناساندم که آنان از او و از￼ من اند. چرا که خداوند در کتاب خود می گوید: «امامت را فرمانی پایدار در نسل او قرار داد...» و من نیز گفته ام که: «مادام که به قرآن و امامان تمسک کنید، گمراه نخواهید شد.»
            هان مردمان! تقوا را، تقوا را رعایت کرده از سختی رستخیز بهراسید همان گونه که خداوند ع ّزوجل فرمود: «البته زمین لرزه ی روز رستاخیز حادثه ی بزرگ است...»
            مرگ، قیامت، و حساب و میزان و محاسبه ی در برابر پروردگار جهانیان و پاداش کیفر را یاد کنید. آن که نیکی آورد، پاداش گیرد. و آن که بدی کرد، بهره ی از بهشت نخواهد برد.
            بخش یازدهم: بیعت گرفتن رسمی￼
            معاِشرالنّاِس،إن ُکْمأَْکثَُرِمْنأَْنتُصاِفقُونیبَکٍّفواِحٍدفیَوْقٍتواِحٍد،َوقَدْأَمرِنی  َع زَوَج لأَْنآُخذَِمْنأَْلِسنَِتُکُماْ ْقرار َََََِِِ
            ِبما َعق دُْتِلَعِلیأَمیِراْلُمْؤمنیَن،َوِلَمْنجاَءَبْعدَهُِمَناْ َِئ مِةِمنّیَوِمْنهُ، َعلیماأَْعلَْمتُُکْمأَ نذُِّری تیِمْن ُصْلِبِه.
            فَقُولُوا بأَ ْجم ِع ُک ْم: «إنّا سا ِمعُو َن ُمطیعُو َن را ُضو َن ُم ْنقادُو َن ِلما َب  ل ْغ َت َع ْن ربّنا َوربّک فی أَ ْمر إما ِمنا َع ِلی أَمیرا ْل ُم ْؤ ِمنی َن َو َِِ َََِِِِِ
            َ م ْ ن ُ و ِ ل د َ ِ م ْ ن ُص ْ ل ِ ب ِ ه ِ م َ ن ا ْ   َ ِ ئ   م ِ ة . ن ُ ب ا ِ ی ع ُ َک َ ع ل ی ذ ا ِ ل َک ِ ب ق ُ ل ُ و ِ ب ن ا َ و أ َ ْ ن ف ُ ِ س ن ا َ و أ َ ْ ل ِ س ن َ ِ ت ن ا َ و أ َ ْ ی د ی ن ا . ع ل ی ذ ا ِ ل َک ن َ ْ ح ی ی َ و َ ع ل َ ْ ی ِ ه ن َ م و ُ ت َ و َ ع ل َ ْ ی ِ ه
            نُْبَعُث.َو نُغَیُّرَو نَُبِدُّل،َو نَُش  ک(َو نَْجَحدُ)َو نَْرتاُب،َو نَْرجُع َعناْلَعْهِدَو نَْنقُ ُضاْلمیثاَق. ِِِ
            هان مردمان! شما بیش از آنید که در یک زمان با یک دست من بیعت نمایید. از این روی خداوند ع ّزوجل به من دستور داده که از زبان شما اقرار بگیرم و پیمان و یت علی امیرالمؤمنین را محکم کنم و نیز بر امامان پس از او که از نسل
            من و اویند؛ همان گونه که اع م کردم که ذ ّر ّیه من از نسل اوست.￼ پس همگان بگویید:
            «البتّه که سخنان تو را شنیده پیروی می کنیم و از آن ها خشنودیم و بر آن گردن گذار و بر آن چه از سوی پروردگارمان در امامت اماممان علی امیرالمؤمنین و امامان دیگر - از صلب او - به ما اب غ کردی، با تو پیمان می بندیم با دل و جان و زبان و دست هایمان. با این پیمان زنده ایم و با آن خواهیم مرد و با آن اعتقاد برانگیخته می شویم. و هرگز آن را دگرگون نکرده ش ّک و انکار نخواهیم داشت و از عهد و پیمان خود برنمی گردیم.
            َوَعْظتَناِبَوْعِظ فی َعِلیأَمیِراْلمْؤِمنیَنَواْ َِئ مِةال ذیَنذََکْرَتِمْنذُِّریِت َکِمْنُوْلِدِهَبْعدَهُ،اْلَحَسِنَواْلُحَسْیِنَوَمْننَ َصَبهُ   َب ْعدَ ُهما. فَا ْل َع ْهدُ َوا ْلمیثا ُق لَ ُه ْم َمأْ ُخوذٌ ِم  نا، ِم ْن قُلُو ِبنا َوأَ ْنفُ ِسنا َوأَ ْل ِسنَ ِتنا َو َضما ِئ ِرنا َوأَ ْیدینا. َم ْن أَدْ َر َکها ِب َی ِد ِه َو ِإ   فَقَدْ أَقَ  ر
            ِ ب ِ ل س ا ِ ن ِ ه ، َ و   ن َ ْ ب ت َ غ ی ِ ب ذ ا ِ ل َک َ ب د َ   ً َ و   َ ی َ ر ی   ِ م ْ ن أ َ ْ ن ف ُ ِ س ن ا ِ ح َ و   ً . ن َ ْ ح ُ ن ن ُ َ ؤ د ّ ی ذ ا ِ ل َک َ ع ْ ن َک ا ّ ل د ا ن ی و ا ل ق ا ص ی ِ م ْ ن ا َ ْ و   ِ د ن ا و ا َ ه ا ل ی ن ا ،￼ َو نُ ْش ِهدُ  ِبذا ِل َک َو َکفی ِبا  َشهیداً َوأَ ْن َت َعلَ ْینا ِب ِه َشهیدٌ
            َمعاِشَرالنّاِس،ماتَقُولوَن؟فَِإ ن َیْعلَُمُک ل َصْوٍتَوخاِفَیةَُکِّلنَْفٍس،(فََمِناْهتَدیفَِلنَْفِسِهَوَمْن َض لفَِإن ماَیِض لَعلَْیها)،
            َو َم ْن ب ا َی َع ف َ ِإ ن   م ا ی ُ ب ا ِی ُع   ، ( َی د ُ   ف َ ْو َق أ َ ْی د ی ِه ْم ) .￼
            َمعاِشَرالنّاِس،فَباِیعُوا َوباِیعُونیَوباِیعُوا َعِلیّاًأَمیَراْلُمْؤِمنیَنَواْلَحَسَنَواْلُحَسْیَنَواْ َِئ مةَ(ِمْنُهْمِفیالد ْنیاَواْ ِخَرِة) َک ِل َمةً با ِق َیةً.
            [ی رسول خدا] ما را به فرمان خدا پند دادی درباره ی علی امیرالمؤمنین و امامان از نسل خود و او، که حسن و حسین￼ و آنان که خداوند پس از آنان برپا کرده است. پس عهد و پیمان از ما گرفته شد از دل و جان و زبان و روح و دستانمان. هر کس توانست با دست وگرنه با زبان پیمان بست. و هرگز پیمانمان را دگرگون نخواهیم کرد و خداوند از ما شکست عهد نبیند. و نیز فرمان تو را به نزدیک و دور از فرزندان و خویشان خود خواهیم رسانید و خداوند را بر آن گواه خواهیم گرفت. و هر آینه خداوند بر گواهی کافی است و تو نیز بر ما گواه باش.»
            هان مردمان! چه می گویید؟ همانا خداوند هر صدایی را می شنود و آن را که از دل ها می گذرد می داند. «هر آن کس هدایت پذیرفت، به خیر خویش پذیرفته. و آن که گمراه شد، به زیان خود رفته.» و هر کس بیعت کند، هر آینه با خداوند پیمان بسته؛ که «دست خدا بالی دستان آن هاست.»
            هان مردمان! اینک با خداوند بیعت کنید و با من پیمان بندید و با علی امیرالمؤمنین و حسن و حسین و امامان پس از￼ آنان از نسل آنان که نشانه ی پایدارند در دنیا و آخرت.
            یُ ْهِل ُک  َم ْن َغدَ َر َو َی ْر َح ُم َم ْن َوفی،( َو َم ْننَ َک َثفَِإن ما َیْن ُک ُث َعلینَ ْف ِس ِه َو َم ْنأَْوفی ِبماعا َهدَ َعلَْیهُ فَ َسیُ ْؤتی ِهأَ ْجراً َع ظ ی م ا ً ) .
            َمعا ِشَرالنّا ِس،قُولُواا لذیقُْل ُتلَ ُکْم َو َسِلُّموا َعلی َعلی ِبِإْمَرِةاْلُمْؤِمنی َن، َوقُولُوا:( َسِمْعنا َوأَ َطْعنا ُغْفرانَ َک َرب نا َو ِإلَْی َک
            َُُْْ  َََََََُّْْ ال َمصی ُر)، َو قولوا: (ال َح ْمد ِ ِ الذی هدانا ِلهذا َو ما کنا ِلنهت ِدی ل ْو  أن هدانا  ) ا یة.
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ِإ  ن ف َ ض ا ِئ َل َع ل ی ْب ِن أ َ ب ی ط ا ِل ٍب ِع ْن د َ   َع  ز َو َج  ل - َو ق َ د ْ أ َ ْن َز ل َ ه ا ِف ی ا ْل ق ُ ْر آ ِن - أ َ ْک ث َ ُر ِم ْن أ َ ْن أ ُ ْح ِص َی ه ا ف ی َم ق ا ٍم و ا ِح ٍد ، ف َ َم ْن أ َ ْن َب ا َ ُک ْم ِب ه ا َو َع َر ف َ ه ا ف َ َص ِد ّ ق ُ و ه ُ .
            َمعا ِش َرالنّا ِس، َم ْن یُ ِط ِع   َو َر ُسولَهُ َو َع ِلیّاً َو ا ْ َ ِئ َمةَ ال ذی َن ذَک ْرتُ ُه ْم فَقَدْ فا َزفَ ْوزاً َعظیماً.
            خداوند م ّکاران را تباه می کند و به باوفایان مهر می ورزد. «هر که پیمان شکند»￼
            جز این نیست که به زیان خود گام برداشته، و هر که بر عهدی که با خدا بسته پابرجا ماند، به زودی خدا او را پاداش بزرگی خواهد داد.»
            هان مردمان! آن چه بر شما برگفتم بگویید و به علی با لقب امیرالمؤمنین س م کنید و بگویید: «شنیدیم و فرمان می بریم پروردگارا، آمرزشت خواهیم و بازگشت به سوی تو است.» و نیز بگویید: «تمام سپاس و ستایش خدایی راست که ما را به این راهنمایی فرمود وگرنه راه نمی یافتیم» - تا آخر آیه.
            هان مردمان! هر آینه برتری هی علی بن ابی طالب نزد خداوند ع ّزوجل - که در قرآن نازل فرموده - بیش از آن است که من یکباره برشمارم. پس هر کس از مقامات او خبر داد و آن ها را شناخت او را تصدیق و تأیید کنید.
            هان مردمان! آن کس که از خدا و رسولش و علی و امامانی که نام بردم پیروی کند، به رستگاری بزرگی دست یافته￼ است.
            َ م ع ا ِ ش َ ر ا ل ن   ا ِ س ، ا ل ّ س ا ِ ب ق ُ و َ ن ِ إ ل ی ُ م ب ا َ ی َ ع ِ ت ِ ه َ و ُ م و ا   ِ ت ِ ه َ و ا ل ت   ْ س ل ی ِ م َ ع ل َ ْ ی ِ ه ِ ب ِ إ ْ م َ ر ِ ة ا ْ ل ُ م ْ ؤ ِ م ن ی َ ن أ ُ و ل ئ َک ُ ه ُ م ا ْ ل ف ا ئ ُ ز و َ ن ف ی َ ج ن ّ ا ِ ت ا ل ن   ع ی ِ م .
            َم ع ا ِش َر ا ل ن ّ ا ِس ، ق ُ و ل ُ و ا م ا َی ْر َض ی   ِب ِه َع ْن ُک ْم ِم َن ا ْل ق َ ْو ِل ، ف َ ِإ ْن ت َ ْک ف ُ ُر و ا أ َ ْن ت ُ ْم َو َم ْن ِف ی ا ْ  َ ْر ِض َج م ی ع ا ً ف َ ل َ ْن َی ُض  ر   َش ْی ئ ا ً .
            الله ماْغِفْرِلْلُمْؤِمنیَن(بماأَد ْیُتَوأَمْرُت)َواْغضْب َعلَی(اْلجاِحدیَن)اْلکاِفریَن،َواْلَحْمدُِ ِرّباْلعالَمیَن. ََِِِ
            هان مردمان! سبقت جویان به بیعت و پیمان و سرپرستی او و س م بر او با لقب امیرالمؤمنین، رستگارانند و در بهشت￼ هی پربهره خواهند بود.
            هان مردمان! آن چه خدا را خشنود کند بگویید. پس اگر شما و تمامی زمینیان کفران ورزند، خدا را زیانی نخواهد رسانید.
            پروردگارا، آنان را که به آن چه ادا کردم و فرمان دادم ایمان آوردند، بیامرز. و بر منکران کافر خشم گیر! و الحمد ّ  ر ّبالعالمین.',

        ]);

        DB::table('questions')->insert([
            'title' => ' پیامبر صلی الله علیه و اله و سلم از حضار غدیر خواستند با چه لقبی بر حضرت علی علیه السلام سلام کنند؟',
            'option_a' => 'امیرالمومنین  ',
            'option_b' => 'امام المبین ',
            'option_c' => 'وصی رسول رب العالمین  ',
            'correct'=>'a',
            'stage_id'=>5
        ]);
        DB::table('questions')->insert([
            'title' => 'طبق فرمایش حضرت رسول صلی الله علیه و اله و سلم راس و ریشه ی امر به معروف چیست؟ ',
            'option_a' => 'تقوا',
            'option_b' => 'امامت',
            'option_c' => 'ایمان',
            'correct'=>'b',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title' => 'بعد از مطرح کردن مساله بیعت حضرت رسول صلی الله علیه و اله بیش از همه بر کدام واجب الهی تاکید نمودند؟ ',
            'option_a' => 'نماز ',
            'option_b' => 'روزه',
            'option_c' => 'حج',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title' => 'ایه شریفه "و جعل کلمه باقیه فی عقبه" به چه امری اشاره دارد؟',
            'option_a' => '  تحقق حکومت صالحان در اخرالزمان ',
            'option_b' => 'امامان پس از علی علیه السلام فرزندان ایشان هستند',
            'option_c' => 'هیچ کدام',
            'correct'=>'b',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title'=>'"فوز عظیم" شامل چه افرادی می شود؟',
            'option_a' => 'کسانی که دوستدار اهل بیت علیهم السلام باشند',
            'option_b' => 'کسانی که با اهل بیت علیهم السلام دشمنی نکنند',
            'option_c' => 'کسانی که مطیع اهل بیت علیهم السلام باشند',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
    }


}
