<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('users')->insert([
            'phone' => '09192952755',
            'name' => 'admin',
            'password'=>bcrypt(123456),
            'chat_id'=> '57647493'
        ]);

        DB::table('stages')->insert([
            'title' => 'مرحله اول',
            'passage' => 'قسمت اول خطبه غدیر
💎 بخش اول: حمد و ثنای الهی💎 

✅ ستایش خدای را سزاست که در یگانگی اش بلند مرتبه و در تنهایی اش به آفریدگان نزدیک است؛ سلطنتش پرجلال و در ارکان آفرینش اش بزرگ است. بی آنکه مکان گیرد و جابه جا شود، بر همه چیز احاطه دارد و بر تمامی آفریدگان به قدرت و برهان خود چیره است. 

🌺 همواره ستوده بوده و خواهد بود و مجد و بزرگی او را پایانی نیست. آغاز و انجام از او و برگشت تمامی امور به سوی اوست. 

🌷اوست آفریننده آسمان ها و گستراننده زمین ها و حکمران آن ها. دور و منزه از خصایص آفریده هاست و در منزه بودن خود نیز از تقدیس همگان برتر است. هموست پروردگار فرشتگان و روح؛ افزونی بخش آفریده ها و نعمت ده ایجاد شده هاست.

🌹 به یک نیم نگاه دیده ها را ببیند و دیده ها هرگز او را نبینند. کریم و بردبار و شکیباست. رحمت اش جهان شمول و عطایش منّت گذار. در انتقام بی شتاب و در کیفر سزاواران عذاب، صبور و شکیباست.

🌸 بر نهان ها آگاه و بر درون ها دانا. پوشیده ها بر او آشکار و پنهان ها بر او روشن است. او راست فراگیری و چیرگی بر هر هستی. نیروی آفریدگان از او و توانایی بر هر پدیده ویژه اوست. او را همانندی نیست 

🥀 و هموست ایجادگر هر موجود در تاریکستان لاشیء. جاودانه و زنده و عدل گستر. جز او خداوندی نباشد و اوست ارجمند و حکیم. 

🌻دیده ها را بر او راهی نیست و اوست دریابنده دیده ها. بر پنهانی ها آگاه و بر کارها داناست. کسی از دیدن به وصف او 
نرسد و بر چگونگی او از نهان و آشکار دست نیابد مگر، او - ع ّزوج ّل ّ - خود، راه نماید و بشناساند. 

💐 و گواهی می دهم که او «الله» است. همو که تن ّزهش سراسر روزگاران را فراگیر و نورش ابدیت را شامل است. بی مشاور، فرمانش را اجرا، بی شریک تقدیرش را امضا و بی یاور سامان دهی فرماید. 

🍀 صورت آفرینش او را الگویی نبوده و آفریدگان را بدون یاور و رنج و چاره جویی، هستی بخشیده است. جهان با ایجاد او موجود و با آفرینش او 
پدیدار شده است. 

🌈 پس اوست «الله» که معبودی به جز او نیست. همو که ُصنعش استوار است و ساختمان آفرینشش زیبا. دادگری است که ستم روا نمی دارد و کریمی که کارهابه او بازمی گردد. 

💥 و گواهی می دهم که او «الله» است که آفریدگان در برابر بزرگی اش فروتن و در مقابل عزتش رام و به توانایی اش 
تسلیم و به هیبت و بزرگی اش فروتن اند. 

🌏 پادشاه هستی ها و چرخاننده سپهرها و رام کننده آفتاب و ماه که هریک تا اَ َجل معین جریان یابند. او پردی شب را به روز و پردی روز را - که شتابان در پی شب است - به شب پیچد.

💪 اوست شکننده ی هر ستمگر سرکش و نابودکنندی هر شیطان رانده شده.) 
نه او را ناسازی باشد و نه برایش انباز و مانندی. یکتا و بی نیاز، نه زاده و نه زاییده شده، او را همتایی نبوده، خداوند 
یگانه و پروردگار بزرگوار است.

👌 بخواهد و به انجام رساند. اراده کند و حکم نماید. بداند و بشمارد. بمیراند و زنده کند. نیازمند و بی نیاز گرداند. بخنداند و بگریاند. نزدیک آورد و دور برد. بازدارد و عطا کند. او راست پادشاهی و ستایش. 

✊️ به دست توانی اوست تمام نیکی. و هموست بر هر چیز توانا. 

☀️ شب را در روز و روز را در شب فرو برد. معبودی جز او نیست؛ گران مایه و آمرزنده؛ اجابت کنندی دعا و افزایندی 
عطا، بر شمارندی نفَس ها؛ پروردگار پری و انسان. 

🌺 چیزی بر او مشکل ننماید، فریاد فریادکنندگان او را آزرده نکند و اصرار ّ اصرارکنندگان او را به ستوه نیاورد. 

❤️ نیکوکاران را نگاهدار، رستگاران را یار، مؤمنان را صاحب اختیار و جهانیان را پروردگار است؛ آن که در همه احوال سزاوار سپاس و ستایش آفریدگان است.
 
🙏 او را ستایش فراوان و سپاس جاودانه می گویم بر شادی و رنج و بر آسایش و سختی و به او و فرشتگان و نبشته ها و فرستاده هایش ایمان داشته، فرمان او را گردن می گذارم و اطاعت می کنم؛ و به سوی خشنودی او می شتابم و به حکم او تسلیمم؛ چرا که به فرمانبری او شائق و از کیفر او ترسانم.

✅ زیرا او خدایی است که کسی از مکرش در امان نبوده و از بی عدالتیش ترسان نباشد (زیرا او را ستمی نیست.) 



💎 بخش دوم: فرمان الهی برای مطلبی مهم💎 

✅ و اکنون به عبودیت خویش و پروردگاری او گواهی می دهم. و وظیفه خود را در آن چه وحی شده انجام می دهم مباد که از سوی او عذابی فرود آید که کسی یاری دورساختن آن از من نباشد. هر چند توانش بسیار و دوستی اش (با من) خالص باشد. 

🌺 - معبودی جز او نیست - چرا که اعلام فرموده که اگر آن چه (درباره ی علی) نازل کرده به مردم نرسانم، وظیفه 
رسالتش را انجام نداده ام؛ و خداوند تبارک و تعالی امنیت از [آزار] مردم را برایم تضمین کرده و البته که او بسنده و 
بخشنده است. 

💥 پس آنگاه خداوند چنین وحی ام فرستاد: «به نام خداوند همه مهر ّ مهرورز. ای فرستادی ما! آن چه از سوی پروردگارت درباره ی علی و خلافت او بر تو فرود آمده بر مردم ابلاغ کن، وگرنه رسالت خداوندی را به انجام نرسانده ای؛ و او تو را از آسیب مردمان نگاه می دارد.» 

⭐️ هان مردمان! آنچه بر من فرود آمده، در تبلیغ آن کوتاهی نکرده ام و حال برایتان سبب نزول آیه را بیان می کنم: 

🌹 همانا جبرئیل سه مرتبه بر من فرود آمد از سوی سلام، پروردگارم - که تنها او سلام است - فرمانی آورد که در این مکان به پا خیزم و به هر سفید و سیاهی اعلام کنم که

❤️ علی بن ابی طالب برادر، وصی و جانشین من در میان ا ّمت و امام پس از 
من بوده. 

💜 جایگاه او نسبت به من به سان هارون نسبت به موسی است، لیکن پیامبری پس از من نخواهد بود او (علی)، صاحب اختیارتان پس از خدا و رسول است؛ 

💝 و پروردگارم آیه ای بر من نازل فرموده که: «همانا ولی، صاحب اختیار و سرپرست شما، خدا و پیامبر او و ایمانیانی هستند که نماز به پا می دارند و در حال رکوع زکات می پردازند.» و هر آینه علی بن ابی طالب نماز به پا داشته و در رکوع زکات پرداخته و پیوسته خداخواه است. 

🌼 و من از جبرئیل درخواستم که از خداوند سلام اجازه کند و مرا از این مأموریت معاف فرماید. زیرا کمی پرهیزگاران و فزونی منافقان و دسیسی ملامت گران و مکر مسخره کنندگان اسلام را می دانم؛ 

⚡️ همانان که خداوند در کتاب خود در 
وصفشان فرموده: «به زبان آن را می گویند که در دل هایشان نیست و آن را اندک و آسان می شمارند حال آن که نزد 
خداوند بس بزرگ است.» 

💥و نیز از آن روی که منافقان بارها مرا آزار رسانیده تا بدانجا که مرا اُذُن [سخن شنو و زودباور ]نامیده اند، به خاطر 
همراهی افزون علی با من و رویکرد من به او و تمایل و پذیرش او از من،

🔥 تا بدانجا که خداوند در این موضوع آیه ای فرو فرستاده: « و از آنانند کسانی که پیامبر خدا را می آزارند و می گویند: او سخن شنو و زودباور است.

🌻 بگو: آری سخن شنو است. - بر علیه آنان که گمان می کنند او تنها سخن می شنود - لیکن به خیر شماست، 

❤️ او (پیامبر صلی الله علیه و آله) به خدا ایمان دارد و مؤمنان را تصدیق می کند و راستگو می انگارد

⚡️و اگر می خواستم نام گویندگان چنین سخنی را بر زبان آورم و یا به آنان اشارت کنم و یا مردمان را به سویشان هدایت 
کنم [که آنان را شناسایی کنند] می توانستم. لیکن سوگند به خدا در کارشان کرامت نموده لب فروبستم. 

⭐️ با این حال خداوند از من خشنود نخواهد گشت مگر این که آن چه در حق علی عیه ال ّسلام فرو فرستاده به گوش شما برسانم.

🌺 سپس پیامبر صلّی الله علیه و آله چنین خواند: «ای پیامبر ما! آن چه از سوی پروردگارت بر تو نازل شده - در حّق ّ علی - ابلاغ کن؛ وگرنه کار رسالتش را انجام نداده ای. و البته خداوند تو را از آسیب مردمان نگاه می دارد.»'

        ]);

        DB::table('questions')->insert([
            'title' => ' موضوع فرازهای اول خطبه غدیر چیست؟',
            'option_a' => ' حمد و ثنای الهی_اعلان رسمی ولایت',
            'option_b' => ' حمد و ثنای الهی_فرمان الهی برای مطلبی مهم',
            'option_c' => ' حمد و ثنای الهی_ تاکید بر توجه امت به مسئله امامت',
            'correct'=>'c',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'در فراز های آغازین خطبه، حضرت رسول صلوات الله علیه و آله می فرماید برای حذر از چه امری آنچه به ایشان ابلاغ شده انجام میدهند؟',
            'option_a' => 'اگر خوداری نمایم از ابلاغ آنچه به من وحی شده، پس تبلیغ رسالت نکرده ام.',
            'option_b' => 'اگر خودداری نمایم از ابلاغ آنچه به من وحی شده، می ترسم به بلایی مبتلا شوم که احدی نتواند از من دفع نماید، هر چند تدبیر او زیاد باشد چرا که نیست الهی جز الله.',
            'option_c' => ' اگر خودداری نمایماز ابلاغ آنچه به من وحی شده، پس هیچکس از عذاب او ایمن نتواند بود.',
            'correct'=>'c',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'در فرازهای آغازین خطبه بیان شده پیامبر در چه صورت وظیفه رسالتش را انجام نداده است؟',
            'option_a' => 'اگر آنچه درباره علی علیه السلام نازل شده به مردم نرساند.',
            'option_b' => 'اگر فرمان الهی را به مردم نرساند. ',
            'option_c' => ' اگر آیات نازل شده را به مردم نرساند.',
            'correct'=>'c',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'در آیه شریفه «إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ رَاكِعُونَ (55)» مراد از کسی که نماز به پا داشته و دررکوع زکات پرداخته کیست؟',
            'option_a' => ' پیامبر صلوات الله علیه و آله.',
            'option_b' => 'علی علیه السلام ',
            'option_c' => ' کسانی که ایمان آورده اند.',
            'correct'=>'c',
            'stage_id'=> 1
        ]);
        DB::table('questions')->insert([
            'title' => 'چرا پیامبر صلوات الله علیه و آله در خطبه می فرمایند: « و من از جبرئیل درخواستم که از خداوند سلام اجازه کند و مرا از این مأموریت معاف فرماید.»؟  ',
            'option_a' => '  به دلیل دشواری مأموریت .',
            'option_b' => ' کمی پرهیزگاران وفزونی منافقان و دسیسی ملامت گران و مکر مسخره کنندگان اسلام  ',
            'option_c' => ' به دلیل طاقت کم مردم.',
            'correct'=>'c',
            'stage_id'=> 1
        ]);

        ######################## stage 2

        DB::table('stages')->insert([
            'title' => 'مرحله دوم',
            'passage' => 'قسمت دوم خطبه غدیر
            

💎بخش سوم: اعلان رسمی ولایت و امامت دوازده امام علیهم السلام💎

 
🌺هان مردمان! بدانید این آیه درباره ی اوست. ژرفی آن را فهم کنید و بدانید که خداوند او را برایتان صاحب اختیار و 
امام قرار داده، پیروی او را بر مهاجران و انصار و آنان که به نیکی از ایشان پیروی می کنند و بر صحرانشینان و شهروندان و بر عجم و عرب و آزاد و برده و بر کوچک و بزرگ و سفید و سیاه و بر هر یکتاپرست لازم شمرده است. 

🌸 [هشدار که] اجرای فرمان و گفتار او لازم و امرش نافذ است. ناسازگارش رانده، پیرو و باورکننده اش در مهر و 
شفقت است. هر آینه خداوند، او و شنوایان سخن او و پیروان راهش را آمرزیده است. 

🌹هان مردمان! آخرین بار است که در این اجتماع به پا ایستاده ام. پس بشنوید و فرمان حق را گردن گذارید؛ چرا که 
خداوند ع ّزوج ّل صاحب اختیار و ولی و معبود شماست؛ و پس از خداوند ولی شما، فرستاده و پیامبر اوست که 
اکنون در برابر شماست و با شما سخن می گوید.

💐 و پس از من به فرمان پروردگار، علی ولی و صاحب اختیار و امام شماست. آن گاه امامت در فرزندان من از نسل علی خواهد بود. این قانون تا برپایی رستاخیز که خدا و رسول او را دیدار کنید دوام دارد. 

🌷روا نیست، مگر آن چه خدا و رسول او و امامان روا دانند؛ و ناروا نیست مگر آن چه آنان ناروا دانند. خداوند عزوجل، هم روا و هم ناروا را برای من بیان فرموده و آن چه پروردگارم از کتاب خویش و حلال و حرامش به من آموخته در اختیار علی نهاده ام. 

❤️ هان مردمان! او را برتر بدانید. چرا که هیچ دانشی نیست مگر اینکه خداوند آن را در جان من نبشته و من نیز آن 
را در جان پیشوای پرهیزکاران، علی، ضبط کرده ام. او (علی) پیشوای روشنگر است که خداوند او را در سوری 
یاسین یاد کرده که: «و دانش هر چیز را در امام روشنگر برشمرده ایم...» 

⭐️هان مردمان! از علی رو برنتابید. و از امامتش نگریزید. و از سرپرستی اش رو برنگردانید. او [شما را] به درستی و راستی خوانده و [خود نیز] بدان عمل نماید. او نادرستی را نابود کند و از آن بازدارد. 

💥در راه خدا نکوهش نکوهش گران او را از کار باز ندارد. او نخستین مؤمن به خدا و رسول اوست و کسی در ایمان، به او سبقت نجسته. و همو جان خود را فدای رسول الله نموده و با او همراه بوده است تنها اوست که همراه رسول خدا 
عبادت خداوند می کرد و جز او کسی چنین نبود. 

⭐️ اولین نمازگزار و پرستشگر خدا به همراه من است. از سوی خداوند به او فرمان دادم تا [در شب هجرت] در بستر 
من بیارامد و او نیز فرمان برده، پذیرفت که جان خود را فدای من کند. 

🌈 هان مردمان! او رابرتر دانید، که خداوند او را برگزیده؛ و پیشوایی او را بپذیرید، که خداوند او را برپا کرده است. 

🌺 هان مردمان! او از سوی خدا امام است و هرگز خداوند توبه منکر او را نپذیرد و او را نیامرزد. این است روش 
قطعی خداوند درباره ناسازگار علی و هرآینه او را به عذاب دردناک پایدار کیفر کند. 

☄️از مخالفت او بهراسید و گرنه در آتشی درخواهید شد که آتش گیری آن مردمانند؛ و سنگ، که برای حق ستیزان آماده شده است. 

🌸 هان مردمان! به خدا سوگند که پیامبران پیشین به ظهورم مژده داده اند و اکنون من فرجام پیامبران و برهان بر 
آفریدگان آسمانیان و زمینیانم. آن کس که راستی و درستی مرا باور نکند به کفر جاهلی درآمده و تردید در سخنان 
امروزم همسنگ تردید در تمامی محتوای رسالت من است، و شک و ناباوری در امامت یکی از امامان، به سان شک و ناباوری در تمامی آنان است. و هرآینه جایگاه ناباوران ما آتش دوزخ خواهد بود. 

🌻هان مردمان! خداوند ع ّزوج ّل از روی منّت و احسان خویش این برتری را به من پیشکش کرد و البته که خدایی 
جز او نیست. آگاه باشید: تمامی ستایش ها در همه روزگاران و در هر حال و مقام ویژه ی اوست. 

🌹هان مردمان! عل را برتر دانید؛ که او برترین مردمان از مرد و زن پس از من است؛ تا آن هنگام که آفریدگان پایدارند و روزی شان فرود آید. 

🌷دور دورباد از درگاه مهر خداوند و خشم خشم باد بر آن که این گفته را نپذیرد و با من سازگار نباشد! 

💐هان! بدانید جبرئیل از سوی خداوند خبرم داد: «هر آن که با علی بستیزد و بر ولایت او گردن نگذارد، نفرین و خشم من بر او باد!» البته بایست که هر کس بنگرد که برای فردای رستاخیز خود چه پیش فرستاده.

🍀 [هان]! تقوا پیشه کنید و از ناسازگاری با علی بپرهیزید. مباد که گام هایتان پس از استواری درلغزد. که خداوند بر کردارتان آگاه است. 

🥀هان مردمان! همانا او هم جوار و همسایه خداوند است که در نبشته ی عزیز خود او را یاد کرده و درباره ی 
ستیزندگان با او فرموده: «تا آنکه مبادا کسی در روز رستخیز بگوید: افسوس که درباری همجوار و همسایه ی خدا 
کوتاهی کردم...» 
 
🌺 هان مردمان! در قرآن اندیشه کنید و ژرفی آیات آن را دریابید و بر محکماتش نظر کنید و از متشابهاتش پیروی ننمایید. 


💥پس به خدا سوگند که باطن ها و
تفسیر آن را آشکار نمی کند مگر همین که دست و بازوی او را گرفته و بالا آورده ام و اعلام می دارم که: 

🌟هر آن که من سرپرست اویم، این علی سرپرست اوست. و او علی بن ابی طالب 
است؛ برادر و وصی من که سرپرستی و ولایت او حکمی است از سوی خدا که بر من فرستاده شده است. 

💥هان مردمان! همانا علی و پاکان از فرزندانم از نسل او، یادگار گران سنگ کوچک ترند و قرآن یادگار گران سنگ 
بزرگ تر. هر یک از این دو از دیگر همراه خود خبر می دهد و با آن سازگار است. آن دو هرگز از هم جدا نخواهند شد تا در حوض کوثر بر من وارد شوند. 

✨هان! بدانید که آنان امانتداران خداوند در میان آفریدگان و حاکمان او در زمین اویند. 

‼️هشدار که من وظیفه ی خود را ادا کردم. هشدار که من آن چه بر عهده ام بود ابلاغ کردم و به گوشتان رساندم و 
روشن نمودم. بدانید که این سخن خدا بود و من از سوی او سخن گفتم.

‼️ هشدار که هرگز به جز این برادرم کسی نباید امیرالمؤمنین خوانده شود. هشدار که پس از من امارت مؤمنان برای کسی جز او روا نباشد. 

✅ سپس فرمود: مردمان! کیست 
سزاوارتر از شما به شما؟ گفتند خداوند و پیامبر او! سپس فرمود آگاه باشید! آن که من سرپرست اویم، پس این علی سرپرست اوست! خداوندا دوست بدار آن را که سرپرستی او را بپذیرد و دشمن بدار هر آن که او را دشمن دارد و یاری کن یار او را؛ و تنها گذار آن را که او را تنها بگذارد.

💎بخش چهارم: بلند کردن امیرالمومنین علیه السلام بدست رسول خداصلی 
الله علیه و آله💎 

🌺 هان مردمان! این علی است برادر و وصی و نگاهبان دانش من. و هموست جانشین من در میان ا ّمت و بر گروندگان به من و بر تفسیر کتاب خدا که مردمان را به سوی او بخواند و به آن چه موجب خشنودی اوست عمل کند و با دشمنانش ستیز نماید. او پشتیبان فرمانبرداری خداوند و بازدارنده از نافرمانی او باشد. 

🌸همانا اوست جانشین رسول الله و فرمانروای ایمانیان و پیشوای هدایتگر از سوی خدا و کسی که به فرمان خدا با پیمان شکنان، رویگردانان از راستی و درستی و به دررفتگان از دین پیکار کند. خداوند فرماید: «فرمان من دگرگون 
نخواهدشد.» 

🌹پروردگارا! اکنون به فرمان تو چنین می گویم: خداوندا! دوستداران او را دوست دار. و دشمنان او را دشمن دار. 
پشتیبانان او را پشتیبانی کن. یارانش را یاری نما. خودداری کنندگان از یاری اش را به خود رها کن. ناباورانش را از مهرت بران و بر آنان خشم خود را فرود آور. 

💥معبودا! تو خود در هنگام برپاداشتن او و بیان ولایتش نازل فرمودی که: «امروز آیین شما را به کمال، و نعمت 
خود را بر شما به اتمام رساندم، و اسلام را به عنوان دین شما پسندیدم.» «و آن که به جز اسلام دینی را بجوید، از 
او پذیرفته نبوده، در جهان دیگر در شمار زیانکاران خواهد بود.» خداوندا، تو را گواه می گیرم که پیام تو را به 
مردمان رساندم.
',

        ]);

        DB::table('questions')->insert([
            'title' => ' مراد از پیشوای روشنگر که خداوند او را در سوره یاسین یاد کرده که: »و دانش هر چیز را در امام روشنگر برشمرده ایم...» چه کسی است؟ ',
            'option_a' => 'حضرت علی علیه السلام ',
            'option_b' => 'حضرت رسول صلوات الله علیه و آله',
            'option_c' => 'امام زمان عجل الله تعالی فرجه الشریف ',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => 'حضرت رسول صلوات الله علیه و آله درباره حضرت امیر و ائمه پس از ایشان چه اصطلاحی را به کار می برند؟',
            'option_a' => 'ثقل اصغر',
            'option_b' => 'ثقل اکبر',
            'option_c' => 'حوض کوثر',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => 'حضرت رسول صلوات الله علیه و آله چه لقبی در مورد حضرت علی علیه السلام را تا ابد بر دیگران حرام دانستند؟',
            'option_a' => 'امام المتقین',
            'option_b' => 'امیرالمومنین ',
            'option_c' => ' جنب الله',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title' => ' همراهی و عدم جدایی ثقل اکبر و اصغر تا کجا بیان شده است؟',
            'option_a' => 'الی الابد',
            'option_b' => 'تا قیامت ',
            'option_c' => 'تا ورود بر پیامبر صلوات الله علیه و آله در حوض کوثر ',
            'correct'=>'c',
            'stage_id'=> 2
        ]);
        DB::table('questions')->insert([
            'title'=>'در قرآن کریم درباره ستیزندگان با امیرالمومنین آمده که ایشان در حق چه کسی کوتاهی می کنند؟ ',
            'option_a' => ' جنب الله',
            'option_b' => '  وجه الله  ',
            'option_c' => ' ید الله',
            'correct'=>'c',
            'stage_id'=> 2
        ]);

        ######################## stage 3

        DB::table('stages')->insert([
            'title' => 'مرحله سوم',
            'passage' => 'قسمت سوم خطبه غدیر
            💎بخش پنجم: تاکید بر توجه امت به مسئله امامت💎
 
🌺هان مردمان! این علی یاورترین، سزاوارترین و نزدیک ترین و عزیزترین شما نسبت به من است. خداوند ع ّزوج ّل و من از او خشنودیم. 

🌸آیه رضایتی در قرآن نیست مگر این که درباره ی اوست. و خدا هرگاه ایمان آوردگان را خطابی نموده به او آغاز کرده [و او اولین شخص مورد نظر خدی متعال بوده است ] . 

🌼و آیه ی ستایشی نازل نگشته مگر 
درباره ی او. و خداوند در سوره ی «هل أتی علی الإنسان» گواهی بر بهشت [رفتن ] نداده مگر بری او، و آن را در 
حق غیر او نازل نکرده و به آن جز او را نستوده است. 

💐 هان مردمان! او یاور دین خدا و دفاع کننده ی از رسول اوست. او پرهیزکار پاکیزه و رهنمی ارشاد شده [به دست خود خدا] است. پیامبرتان برترین پیامبر، وصی او برترین وصی و فرزندان او برترین اوصیایند. 

🌹هان مردمان! فرزندان هرپیامبر از نسل اویند و فرزندان من از صلب و نسل امیرالمؤمنین علی است. 

🌷هان مردمان! به راستی که شیطا ِن اغواگر، آدم را با رشک از بهشت رانده مبادا شما به علی رشک ورزید که کرده 
هایتان نابود و گام هایتان لغزان خواهدشد. 

⚡️آدم به خاطر یک اشتباه به زمین هبوط کرد و حال آن که برگزیده ی خدی 
ع ّزوج ّل بود. پس چگونه خواهید بود شما و حال آن که شما شمایید و دشمنان خدا نیز از میان شمایند. 

🔥آگاه باشید! که با علی نمی ستیزد مگر بی سعادت. و سرپرستی او را نمی پذیرد مگر رستگار پرهیزگار. و به او نمی گرود مگر ایمان دار بی آلایش. 
 
💥و سوگند به خدا که سوره ی والعصر درباره ی اوست: «به نام خداوند همه مهر مهر ورز. قسم به زمان که انسان در 
زیان است.» مگر علی که ایمان آورده و به درستی و شکیبایی آراسته است. 

🌈 هان مردمان! خدا را گواه گرفتم و پیام او را به شما رسانیدم. و بر فرستاده وظیفه ی جز بیان و ابلاغ روشن نباشد! 

🥀هان مردمان! تقوا پیشه کنید همان گونه که بایسته است. و نمیرید جز با شرِف اسلام.

💎بخش ششم: اشاره به کارشکنی های منافقین💎 
 
🌺هان مردمان! «به خدا و رسول و نور همراهش ایمان آورید پیش از آن که چهره ها را تباه و باژگونه کنیم یا چونان 
اصحاب روز شنبه [یهودیانی که بر خدا نیرنگ آوردند] رانده شوید.

🌸«به خدا سوگند که مقصود خداوند از این آیه گروهی از صحابه اند که آنان را با نام و نَ َسب می شناسم لیکن به پرده پوشی کارشان مأمورم. آنک هر کس پایه کار خویش را مهر و یا خشم علی در دل قرار دهد [و بداند که ارزش عمل او وابسته به آن است]. . 

🌼مردمان! نور از سوی خداوند ع ّزوجل در جان من، سپس در جان علی بن ابی طالب، آن گاه در نسل او تا قائم مهدی - 
که حق خدا و ما را می ستاند - جی گرفته. 

💥چرا که خداوند ع ّزوجل ما را بر کوتاهی کنندگان،ستیزهگران،ناسازگاران، 
خائنان و گنهکاران و ستمکاران و غاصبان از تمامی جهانیان دلیل و راهنما و حجت آورده است. 

⭐️هان مردمان! هشدارتان می دهم: همانا من رسول خدایم. پیش از من نیز رسولانی آمده و سپری گشته اند. آیا اگر من بمیرم یا کشته شوم، به جاهلیت عقب گرد می کنید؟ 

🍀آن که به قهقرا برگردد، هرگز خدا را زیانی نخواهد رسانید و خداوند سپاسگزاران شکیباگر را پاداش خواهد داد. بدانید که علی و پس از او فرزندان من از نسل او، داری کمال شکیبایی و سپاسگزاری اند. 

💐هان مردمان! اسلامتان را بر من منت نگذارید؛ که اعمال شما را بیهوده و تباه خواهد کرد و خداوند بر شما خشم خواهد گرفت و سپس شما را به شعله ی از آتش و مس گداخته گرفتار خواهد نمود. همانا پروردگار شما در کمین گاه است. 
 
🌻مردمان! به زودی پس از من پیشوایانی خواهند بود که شما را به سوی آتش می خوانند و در روز رستاخیز تنها وبدون یاور خواهند ماند. 
هان مردمان! خداوند و من از آنان بیزاریم. 

🌺هان مردمان! آنان و یاران و پیروانشان در بدترین جی جهنم، جایگاه متکبّران خواهند بود. بدانید آنان اصحاب صحیفه اند. اکنون هر کس در صحیفه ی خود نظر کند. 

🌸هان مردمان! اینک جانشینی خود را به عنوان امامت و وراثت به امانت به جی می گذارم در نسل خود تا برپایی روز رستاخیز. 

🌼و حال، مأموریت تبلیغی خود را انجام می دهم تا برهان بر هر شاهد و غایب و بر آنان که زاده شده یا نشده اند و بر تمامی مردمان باشد. پس بایسته است این سخن را حاضران به غایبان و پدران به فرزندان تا برپایی رستاخیز برسانند. 

💐آگاه باشید! به زودی پس از من امامت را با پادشاهی جابه جا نموده. آن راغصب کرده و به تصرف خویش درآورند. 

☄️هان! نفرین و خشم خدا بر غاصبان و چپاول گران! و البته در آن هنگام خداوند آتش عذاب - شعله هی آتش و مس گداخته - بر سر شما جن و انس خواهد ریخت. آن جاست که دیگر یاری نخواهید شد. 

🔥هان مردمان! هر آینه خداوند عزوجل شما را به حالتان رها نخواهد کرد تا ناپاک را ازپاک جدا کند. و خداوند نمی خواهد شما را بر غیب آگاه گرداند. (اشاره به آیه ی / 179آل عمران است.) 

💥هان مردمان! هیچ سرزمینی نیست مگر این که خداوند به خاطر تکذیب اهل آن [حق را] ، آنان را پیش از روز رستاخیز نابود خواهد فرمود و به امام مهدی خواهد سپرد. و هر آینه خداوند وعده ی خود را انجام خواهد داد. 

⚡️هان مردمان! پیش از شما، شمار فزونی از گذشتگان گمراه شدند و خداوند آنان را نابود کرد. و همو نابودکننده ی 
آیندگان است. 
 
🌺او خود در کتابش آورده: «آیا پیشینیان را تباه نکردیم و به دنبال آنان آیندگان را گرفتار نساختیم؟ با مجرمان این چنین کنیم. وی بر ناباوران!» 

🌸هان مردمان! همانا خداوند امر و نهی خود را به من فرموده و من نیز به دستور او دانش آن را نزد علی نهادم. پس فرمان او  بشنوید و گردن نهید و پیرویش نمایید و از آنچه بازتان دارد خودداری کنید تا راه یابید. به سوی هدف او 
حرکت کنید. راههای گونه گون شما را از راه او بازندارد!
',

        ]);

        DB::table('questions')->insert([
            'title' => 'طبق بیانات پیامبر صلوات الله علیه و آله در خطبه که میفرمایند آنان که از او و جانشینانش از فرزندان من و از نسل او - تا برپایی رستاخیز و عرضه ی بر خدا - پیروی نکنند، چه عاقبتی خواهند داشت؟',
            'option_a' => 'در دو جهان کرده هایشان بیهوده بوده در آتش دوزخابدی خواهند بود ',
            'option_b' => 'نه از عذابشان کاسته و نه برایشان فرصتی خواهد بود.',
            'option_c' => 'هر دو مورد ',
            'correct'=>'c',
            'stage_id'=>3
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام موضوع است که چنانچه آیه ای در قرآن در آن موضوع نازل شده باشد، الا و لابد در ارتباط با امیرالمومنین علیه السلام است؟',
            'option_a' => 'رضایت',
            'option_b' => 'ستایش',
            'option_c' => 'هر دو مورد',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام سوره از سوره های قرآن در شان امیرالمومنین علیه السلام نازل شده؟',
            'option_a' => 'عصر',
            'option_b' => 'انسان ',
            'option_c' => ' هر دو مورد',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title' => 'پیامبر صلوات الله علیه و آله با اشاره به علت رانده شدن آدم از بهشت توسط شیطان اغواگر، از چه امری نسبت به حضرت علی علیه السلام نهی می نمایند؟ ',
            'option_a' => 'دشمنی ',
            'option_b' => 'کینه توزی',
            'option_c' => 'حسد ',
            'correct'=>'c',
            'stage_id'=> 3
        ]);
        DB::table('questions')->insert([
            'title'=>'این قسمت از خطبه که میفرماید «مردمان! به زودی پس از من پیشوایانی خواهند بود که شما را به سوی آتش می خوانند و در روز رستاخیز تنها وبدون یاور خواهند ماند. هان مردمان! خداوند و من از آنان بیزاریم. هان مردمان! آنان و یاران و پیروانشان در بدترین جای جهنم، جایگاه متکبّران خواهند بود. » با چه تعبیری از این پیشوایان یاد می شود؟ ',
            'option_a' => '  اصحاب سبته',
            'option_b' => '  اصحاب صحیفه  ',
            'option_c' => 'ائمه کفر',
            'correct'=>'c',
            'stage_id'=> 3
        ]);

        ######################## stage 4

        DB::table('stages')->insert([
            'title' => 'مرحله چهارم',
            'passage' => 'قسمت چهارم خطبه غدیر
💎بخش هفتم: پیروان اهل بیت علیهم السلام و دشمنان ایشان💎 

🌺 هان مردمان! صراط مستقیم خداوند منم که شما را به پیروی آن امر فرموده. و پس از من علی است و آن گاه فرزندانم 
از نسل او، پیشوایان راه راستند که به درستی و راستی راهنمایند و به آن حکم و دعوت کنند. 

🌸سپس پیامبر صلّی الله علیه و آله قرائت فرمود: «بسم الله ال ّرحمن ال ّرحیم الحمد ّلِلّ ر ّب العالمین ال ّرحمن ال ّرحیم...» - تا آخر سوره. 

🌼هان! به خدا سوگند این سوره درباره ی من نازل شده و شامل امامان می باشد و به آنان اختصاص دارد. آنان اولیای خدایند که ترس و اندوهی برایشان نیست، آگاه باشید: البته حزب خدا چیره و غالب خواهد بود. 

🔥هشدار که: ستیزندگان با امامان، گمراه و همکاران شیاطین اند. برای گمراهی مردمان، سخنان بیهوده و پوچ را به یکدیگر می رسانند. بدانید که خداوند از دوستان امامان در کتاب خود چنین یاد کرده: [«ی پیامبر ما] نمی یابی ایمانیان به خدا و روز بازپسین، که ستیزه گران خدا و رسول را دوست ندارند، گرچه آنان پدران، برادران و خویشانشان باشند. آنان [که چنین اند] خداوند ایمان را در دل هایشان نبشته است.» - تا آخر آیه. 

🌻هان! دوستداران امامان ایمانیان اند که قرآن چنان توصیف فرموده: «آنان که ایمان آورده و باور خود را به شرک نیالوده اند، در امان و در راه راست هستند.» 

🥀هشدار! یاران پیشوایان کسانی هستند که به باور رسیده و از تردید و انکار دور خواهند بود. 

🌹هشدار! اولیی امامان آنانند که با آرامش و سلام به بهشت درخواهند شد و فرشتگان با سلام آنان را پذیرفته، خواهند گفت: «درود بر شما که پاک شده اید. اینک داخل شوید که در بهشت، جاودانه خواهید بود.» 

🌷هان! بهشت پاداش اولیی آنان است و در آن بی حساب روزی داده خواهند شد. 
هان! دشمنان آنان آن کسانی اند که در آتش درآیند. و همانا ناله ی افروزش جهنم را می شنوند در حالی که شعله هی آتش زبانه می کشد و زفیر (صدی بازدم) جهنم را نیز درمی یابند. 

💥هان! خداوند درباره ی ستیزگران با آنان فرموده: «هرگاه امتی داخل جهنم شود همتی خود را نفرین کند.» 

☄️هشدار! که دشمنان امامان همانانند که خداوند درباره ی آنان فرموده: «هر گروهی از آنان داخل جهنم شودنگاهبانان 
می پرسند: مگر برایتان ترساننده ی نیامد؟! می گویند: چرا ترساننده آمد لیکن تکذیب کردیم و گفتیم: خداوند وحی نفرستاده و شما نیستید مگر در گمراهی بزرگ!» تا آن جا که فرماید: «هان! نابود باد دوزخیان!» 

🌺هان! یاران امامان در نهان، ازپروردگار خویش ترسانند، آمرزش و پاداش بزرگ بری آنان خواهد بود. 

🌸هان مردمان! چه بسیارراه است میان آتش و پاداش بزرگ! 
 هان مردمان! خداوند ستیزه جویان ما را ناستوده و نفرین فرموده و دوستان ما را ستوده و دوست دارد. 

🌼هان مردمان! بدانید که همانا من انذارگرم و علی مژده دهنده. 
هان! که من بیم دهنده ام و علی راهنما. 
هان مردمان! بدانید که من پیامبرم و علی وصی من است. 

🌻هان مردمان! بدانید که همانا من فرستاده و علی امام و وصی پس از من است. و امامان پس از او فرزندان اویند. 
آگاه باشید! من والد آنانم ولی ایشان از نسل علی خواهند بود.

💎بخش هشتم: حضرت مهدی عجل الله فرجه الشریف💎 

🌺آگاه باشید! همانا آخرین امام، قائم مهدی از ماست. هان! او بر تمامی ادیان چیره خواهد بود. 

🌸هشدار! که اوست انتقام گیرنده از ستمکاران. 
هشدار! که اوست فاتح دژها و منهدم کننده ی آنها. 
هشدار! که اوست چیره بر تمامی قبایل مشرکان و راهنمی آنان. 
هشدار! که او خونخواه تمام اولیی خداست. 

🌼آگاه باشید! اوست یاور دین خدا. 
هشدار! که از دریایی ژرف پیمانه هایی افزون گیرد. 

🌻هشدار! که او به هر ارزشمندی به اندازه ی ارزش او، و به هر نادان و بی ارزشی به اندازه ی نادانی اش نیکی کند. 

🥀هشدار! که او نیکو و برگزیده ی خداوند است. 
هشدار! که او وارث دانش ها و حاکم بر ادراک هاست. 

🌹هان! بدانید که او از سوی پروردگارش سخن می گوید و آیات و نشانه های او را برپا کند. بدانید همانا اوست بالیده و 
استوار. 

🌷بیدار باشید! هموست که [اختیار امور جهانیان و آیین آنان ] به او واگذار شده است. 
آگاه باشید! که تمامی گذشتگان ظهور او را پیشگویی کرده اند. 

💐آگاه باشید! که اوست ح ّجت پایدار و پس از او ح ّجتی نخواهد بود درستی و راستی و نور و روشنایی تنها نزد 
اوست. 

💥هان! کسی بر او پیروز نخواهد شد و ستیزنده ی او یاری نخواهد گشت. 
آگاه باشید که او ولی خدا در زمین، داور او در میان مردم و امانتدار امور آشکار و نهان است. 

🌺 این تعبیر به عنوان ح ّجت و امامت است و نظری به رجعت دیگر امامان ندارد زیرا آنان حجت های پیشین اند که 
دوباره رجعت خواهند نمود.


            ',

        ]);

        DB::table('questions')->insert([
            'title' => 'حضرت رسول صلوات الله علیه و آله پس از تلاوت کدام سوره فرمودند :«هان! به خدا سوگند این سوره درباره ی من نازل شده و شامل امامان می باشد و به آنان اختصاص دارد.» ؟',
            'option_a' => 'حمد  ',
            'option_b' => 'عصر ',
            'option_c' => 'یاسین  ',
            'correct'=>'c',
            'stage_id'=>4
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام آیه در وصف دوستان اوصیای حضرت رسول صلوات الله علیه و آله نیست؟',
            'option_a' => 'کدام آیه در وصف دوستان اوصیای حضرت رسول صلوات الله علیه و آله نیست؟',
            'option_b' => 'یوحی بَعْضَّهُمْ إِلی بَعْضٍ زُخْرُفَ الْقَوْلِ غُروراً',
            'option_c' => 'الَّذینَ آمَنُوا وَلَمْ یَلْبِسُوا إیمانَُهُمْ بِظُلْمٍ أُولئِکَ لَُهُمُ الْأَمْنُ وَ هُمْ مُُهْتَدونَ',
            'correct'=>'c',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام آیه در وصف دشمنان اوصیای حضرت رسول صلوات الله علیه و آله نیست؟',
            'option_a' => 'کُلَّما دَخَلَتْ أُمَّةٌ لَعَنَتْ أُخْتَُها',
            'option_b' => 'الَّذینَ یَسْمَعونَ لِجَُهَنَّمَ شَُهیقاً وَ هِی تَفورُ وَ یَرَوْنَ لَُها زَفیراً ',
            'option_c' => 'الَّذینَ یَخْشَوْنَ رَبَّهُمْ بِالْغَیْبِ، لَُهُمْ مَغْفِرَةٌ وَأَجْرٌ کَبیر',
            'correct'=>'c',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title' => 'کدام صفات برای حضرت علی علیه السلام بکار برده شده است؟ ',
            'option_a' => ' نذیر-منذر-هاد  ',
            'option_b' => 'نذیر-بشیر- هاد',
            'option_c' => 'بشیر-هاد-وصی  ',
            'correct'=>'c',
            'stage_id'=> 4
        ]);
        DB::table('questions')->insert([
            'title'=>'تعابیر «اوست فاتح دژها و منهدم کننده ی آنها»، «وارث دانش ها و حاکم بر ادراک هاست»، «آگاه باشید که او ولی خدا در زمین، داور او در میان مردم و امانتدار امور آشکار و نهان است.» درباره چه کسی است؟  ',
            'option_a' => 'امام زمان عجل الله تعالی فرجه الشریف',
            'option_b' => ' حضرت علی علیه السلام  ',
            'option_c' => 'هر دو',
            'correct'=>'c',
            'stage_id'=> 4
        ]);


        ######################## stage 5

        DB::table('stages')->insert([
            'title' => 'مرحله پنجم',
            'passage' =>'قسمت پنجم خطبه غدیر
            
💎بخش نهم: مطرح کردن بیعت💎 

🌺 هان مردمان! من پیام خدا را برایتان آشکار کرده تفهیم نمودم. و این علی است که پس از من شما را آگاه می کند. اینک 
شما را می خوانم که پس از پایان خطبه با من و سپس با علی دست دهید تا با او بیعت کرده به امامت او اقرار نمایید. 

🌸آگاه باشید من با خداوند و علی با من پیمان بسته و من اکنون از سوی خدی ع ّزوجل بری امامت او پیمان می گیرم. [«ی پیامبر ]آنان که با تو بیعت کنند هر آینه با خدا بیعت کرده اند.

💥 دست خدا بالای دستان آنان است. و هر کس بیعت شکند، بر زیان خودشکسته، و آن کس که بر پیمان خداوند استوار و باوفا باشد، خداوند به او پاداش بزرگی خواهد داد.

💎بخش دهم: حلال و حرام، واجبات و محرمات💎 

🌺هان مردمان! همانا حج و عمره از شعائر و آداب و رسوم خدایی است. پس زائران خانه ی خدا و عمره کنندگان بر صفا و مروه بسیار طواف کنند. 

🌸هان مردمان! در خانه ی خدا حج گزارید؛ که هیچ خاندانی داخل آن نشد مگر بی نیاز شد و مژده گرفت، و کسی از آن روی برنگردانید مگر بی بهره و نیازمند گردید. 

🌼هان مردمان! مؤمنی در موقف (عرفات، مشعر، منا) نمانَد مگر این که خدا گناهان گذشته ی او را بیامرزد و بایسته است که پس از پایان اعمال حج [با پرونده ی پاک ] کار خود را از سر گیرد. 

🌻هان مردمان! حاجیان دستگیری شده اند و هزینه هی سفرشان جبران می شود و جایگزین آن به آنان خواهد رسید. و 
البته خداوند پاداش نیکوکاران را تباه نخواهد کرد. 

🥀هان مردمان! خانه ی خدا را با دین کامل و دانش ژرفی آن دیدار کنید و از زیارتگاهها جز با توبه و بازایستادن [از 
گناهان ] برنگردید. 

🌹هان مردمان! نماز را به پا دارید و زکات بپردازید همان سان که خداوند ع ّزوجل امر فرموده. پس اگر زمان بر شما 
دراز شد و کوتاهی کردید یا از یاد بردید، علی صاحب اختیار و تبیین کننده ی بر شماست. 

🌷خداوند ع ّزوجل او راپس از من امانتدار خویش در میان آفریدگانش نهاده. همانا او از من و من از اویم. و او و فرزندان من از جانشینان او، پرسش های شما راپاسخ دهند و آن چه را نمی دانید به شما می آموزند. 

💐هان! روا و ناروا بیش از آن است که من شمارش کنم و بشناسانم و در این جا یکباره به روا فرمان دهم و از ناروا بازدارم. از این روی مأمورم از شما بیعت بگیرم که دست در دست من نهید در مورد پذیرش آن چه از سوی خداوند 
آورده ام درباری علی امیرالمؤمنین و اوصیای پس از او که آنان از من و اویند. 

💥و این امامت به وراثت پایدار است و 
فرجام امامان، مهدی است و استواری امامت تا روزی است که او با خداوند قدر و قضا دیدار کند. 

⭐️هان مردمان! شما را به هرگونه روا و ناروا راهنمایی کردم و از آن هرگز برنمی گردم. بدانید و آگاه باشید! آن ها را یاد کنید و نگه دارید و یکدیگر را به آن توصیه نمایید و در آن [احکام خدا] دگرگونی راه ندهید.

⚡️ هشدار که دوباره می گویم: بیدار باشید! نماز را به پا دارید. و زکات بپردازید. و امر به معروف کنید و از منکر بازدارید. 

🌺و بدانید که ریشه ی امر به معروف این است که به گفته ی من [درباره ی امامت ] برسید و سخن مرا به دیگران 
برسانید و غایبان را به پذیرش فرمان من توصیه کنید و آنان را از ناسازگاری سخنان من بازدارید؛ همانا سخن من 
فرمان خدا و من است و هیچ امر به معروف و نهی از منکری جز با امام معصوم تحقق و کمال نمی یابد. 

🌸هان مردمان! قرآن بر شما روشن می کند که امامان پس از علی فرزندان اویند و من به شما شناساندم که آنان از او و از 
من اند. چرا که خداوند در کتاب خود می گوید: «امامت را فرمانی پایدار در نسل او قرار داد...» و من نیز گفته ام که: 
«مادام که به قرآن و امامان تمسک کنید، گمراه نخواهید شد.» 

🌼هان مردمان! تقوا را، تقوا را رعایت کرده از سختی رستخیز بهراسید همان گونه که خداوند ع ّزوجل فرمود: «البته 
زمین لرزه ی روز رستاخیز حادثه ی بزرگ است...» 

🌻مرگ، قیامت، و حساب و میزان و محاسبه ی در برابر پروردگار جهانیان و پاداش کیفر را یاد کنید. آن که نیکی آورد، پاداش گیرد. و آن که بدی کرد، بهره ی از بهشت نخواهد برد.

💎بخش یازدهم: بیعت گرفتن رسمی💎
 
🌺هان مردمان! شما بیش از آنید که در یک زمان با یک دست من بیعت نمایید. از این روی خداوند ع ّزوجل به من دستور 
داده که از زبان شما اقرار بگیرم و پیمان ولایت علی امیرالمؤمنین را محکم کنم و نیز بر امامان پس از او که از نسل من و اویند؛ همان گونه که اعلام کردم که ذ ّریّه من از نسل اوست. 

🌸پس همگان بگویید: 
«البتّه که سخنان تو را شنیده پیروی می کنیم و از آن ها خشنودیم و بر آن گردن گذار و بر آن چه از سوی پروردگارمان در امامت اماممان علی امیرالمؤمنین و امامان دیگر - از صلب او - به ما ابلاغ کردی، با تو پیمان می بندیم با دل و جان و زبان و دست هایمان. با این پیمان زنده ایم و با آن خواهیم مرد و با آن اعتقاد برانگیخته می شویم. و هرگز آن

را دگرگون نکرده ش ّک و انکار نخواهیم داشت و از عهد و پیمان خود برنمی گردیم. 

🌼[ی رسول خدا] ما را به فرمان خدا پند دادی درباره ی علی امیرالمؤمنین و امامان از نسل خود و او، که حسن و حسین و آنان که خداوند پس از آنان برپا کرده است. پس عهد و پیمان از ما گرفته شد از دل و جان و زبان و روح و دستانمان. 

🌹هر کس توانست با دست وگرنه با زبان پیمان بست. و هرگز پیمانمان را دگرگون نخواهیم کرد و خداوند از ما شکست عهد نبیند. و نیز فرمان تو را به نزدیک و دور از فرزندان و خویشان خود خواهیم رسانید و خداوند را بر آن گواه 
خواهیم گرفت. و هر آینه خداوند بر گواهی کافی است و تو نیز بر ما گواه باش.» 

🌷هان مردمان! چه می گویید؟ همانا خداوند هر صدایی را می شنود و آن را که از دل ها می گذرد می داند. «هر آن کس هدایت پذیرفت، به خیر خویش پذیرفته. و آن که گمراه شد، به زیان خود رفته.» و هر کس بیعت کند، هر آینه با خداوند پیمان بسته؛ که «دست خدا بالی دستان آن هاست.» 

💐هان مردمان! اینک با خداوند بیعت کنید و با من پیمان بندید و با علی امیرالمؤمنین و حسن و حسین و امامان پس از آنان از نسل آنان که نشانه ی پایدارند در دنیا و آخرت. 

🌻خداوند م ّکاران را تباه می کند و به باوفایان مهر می ورزد. «هر که پیمان شکند» جز این نیست که به زیان خود گام برداشته، و هر که بر عهدی که با خدا بسته پابرجا ماند، به زودی خدا او را پاداش بزرگی خواهد داد.» 

⭐️هان مردمان! آن چه بر شما برگفتم بگویید و به علی با لقب امیرالمؤمنین سلام کنید و بگویید: «شنیدیم و فرمان می بریم پروردگارا، آمرزشت خواهیم و بازگشت به سوی تو است.» و نیز بگویید: «تمام سپاس و ستایش خدایی راست که ما را به این راهنمایی فرمود وگرنه راه نمی یافتیم» - تا آخر آیه. 

🌈هان مردمان! هر آینه برتری هی علی بن ابی طالب نزد خداوند ع ّزوجل - که در قرآن نازل فرموده - بیش از آن است 
که من یکباره برشمارم. پس هر کس از مقامات او خبر داد و آن ها را شناخت او را تصدیق و تأیید کنید. 

💥هان مردمان! آن کس که از خدا و رسولش و علی و امامانی که نام بردم پیروی کند، به رستگاری بزرگی دست یافته است. 

⚡️هان مردمان! سبقت جویان به بیعت و پیمان و سرپرستی او و سلام بر او با لقب امیرالمؤمنین، رستگارانند و در بهشت 
هی پربهره خواهند بود. 

🌺هان مردمان! آن چه خدا را خشنود کند بگویید. پس اگر شما و تمامی زمینیان کفران ورزند، خدا را زیانی نخواهد رسانید. 

🌸پروردگارا، آنان را که به آن چه ادا کردم و فرمان دادم ایمان آوردند، بیامرز. و بر منکران کافر خشم گیر! و الحمد ّللّه رّب العالمین.

',

        ]);

        DB::table('questions')->insert([
            'title' => 'بعد از مطرح کردن مسئله بیعت، حضرت رسول صلوات الله علیه و آله پیش از همه به کدام واجب الهی تاکید بسیار می نمایند؟',
            'option_a' => 'نماز  ',
            'option_b' => 'روزه ',
            'option_c' => 'حج  ',
            'correct'=>'c',
            'stage_id'=>5
        ]);
        DB::table('questions')->insert([
            'title' => 'طبق فرمایش حضرت رسول صلوات الله علیه و آله راس و ریشه امر به معروف چیست؟ ',
            'option_a' => 'امامت',
            'option_b' => 'ایمانً',
            'option_c' => 'تقواَ',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title' => 'زمان بیعت گرفتن رسمی برای حضرت علی علیه السلام از حضار در غدیر این بیعت چگونه گرفته شد؟ ',
            'option_a' => 'در یک زمان با یک دست ',
            'option_b' => 'اقرار گرفتن زبانی به دلیل کثرت جمعیت ً ',
            'option_c' => 'هر کس توانست با دست وگرنه با زبان پیمان بست',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title' => 'پیامبر صلوات الله علیه و آله از حضار غدیر خواستند با چه لقبی بر حضرت علی علیه السلام سلام کنند؟',
            'option_a' => ' امیرالمومنین   ',
            'option_b' => 'امام المبین',
            'option_c' => 'وصی رسول رب العالمین   ',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
        DB::table('questions')->insert([
            'title'=>'پیامبر صلوات الله علیه و آله درباره فضایل حضرت علی علیه السلام چه فرمودند؟ ',
            'option_a' => 'بیش از آن است که من یکباره برشمارم  ',
            'option_b' => ' هر کس از مقامات او خبر داد و آن ها را شناخت او را تصدیق و تأیید کنید.  ',
            'option_c' => 'هر دو',
            'correct'=>'c',
            'stage_id'=> 5
        ]);
    }


}
